<HEAD>
<TITLE>XDM-photo, un chouette XDM pour LINUX</TITLE>
</HEAD>
<BODY>

<IMG SRC="images/motif.gif" ALIGN=left HSPACE=10> 
<H1>
<P>XDM-photo, 
<BR> un chouette XDM pour LINUX
</H1>
<P>
Article pour l'Echo de Linux (<em><b>Juillet 1996</b></em>) 
<address><a href="mailto:pierre@rd.lectra.fr">Pierre Ficheux 
(pierre@rd.lectra.fr)</a></address> 

<BR CLEAR=left>
<HR>

<H2>R&eacute;sum&eacute;</H2>
Cet article pr&eacute;sente le programme <EM>XDM</EM> (X Display Manager) ainsi que
sa version am&eacute;lior&eacute;e <EM>XDM-photo</EM>. Une description des fichiers de 
configuration est donn&eacute;e ainsi que les ressources sp&eacute;cifiques &agrave; <EM>XDM-photo</EM>
et les diverses m&eacute;thodes permettant de cr&eacute;er facilement les fichier <EM>XPM</EM>
utilis&eacute;es par <EM>XDM-photo</EM>.

<HR>
<H1>Sommaire</H1>
<UL>
<LI>1 - <A HREF="#1">Qu'est-ce qu'XDM ?</A>
<LI>2 - <A HREF="#2">Configuration de XDM</A>
<LI>3 - <A HREF="#3">D&eacute;marrage du d&eacute;mon XDM</A>
<LI>4 - <A HREF="#4">Les apports de XDM-Photo</A>
	<UL>
	<LI>4.1 <A HREF="#41">Introduction</A>
	<LI>4.2 <A HREF="#42">Le widget Login modifi&eacute;</A>
	<LI>4.3 <A HREF="#43">Nouvelles ressources</A>
	<LI>4.4 <A HREF="#44">Comment cr&eacute;er des pixmaps XPM</A>
	</UL>
<LI>5 - <A HREF="#5">Comment compiler XDM-photo</A>
<LI>6 - <A HREF="#6">Archives t&eacute;l&eacute;chargeables</A>
</UL>

<A NAME=1>
<H1>Qu'est-ce qu'XDM ?</H1>
<EM>XDM</EM> (X Display Manager) est un client standard de la distribution 
<EM>X Window System</EM>. Ecrit &agrave; l'origine par <EM>Keith Packard</EM>, il est 
utilis&eacute; pour g&egrave;rer  diff&eacute;rents <EM>displays</EM> X. Le cas le plus fr&eacute;quent 
d'utilisation est le contr&ocirc;le d'un parc de terminaux X.
<P>
<EM>XDM</EM> se charge du controle du <EM>login/logout</EM> des utilisateurs, du
test de l'activit&eacute; du serveur X sur chaque display. Le dialogue entre le d&eacute;mon
<EM>xdm</EM> sur le host et le serveur X utilise un protocole appel&eacute; 
<EM>XDMCP</EM> (XDM Communication Protocol) d&eacute;velopp&eacute; par 
<A HREF="http://www.ncd.com">NCD (NetworkComputing Devices)</A>
leader des constructeurs de terminaux X.
<P>
Cependant, <EM>XDM</EM> peut aussi &ecirc;tre utilise sur une station de travail. Au 
lieu d'utiliser le programme <EM>xinit</EM> depuis une rustique session en mode 
texte, <EM>XDM</EM> permet un login  directement dans un &eacute;cran X. le programme
<EM>chooser</EM>, compil&eacute; avec <EM>xdm</EM> permet &eacute;galement de selectionner la
station sur laquelle vous d&eacute;sirez vous loger.

<A NAME=2>
<H1>Configuration de XDM</H1>

<EM>XDM</EM> est livr&eacute; pr&eacute;-configur&eacute; sur la plupart des distributions 
<EM>LINUX</EM> avec les packages
<A HREF="ftp://ftp.ibp.fr/pub/X11/XFree86">XFree86</A>. Voici cependant une
description sommaire des fichiers principaux permettant le param&egrave;trage de
<EM>XDM</EM>. Comme tous les clients X, <EM>xdm</EM> est compl&egrave;tement configurable
par ressources. 
<P>
Les fichiers de configuration sont plac&eacute;s sur
le r&eacute;pertoire <EM>/usr/X11R6/lib/X11/xdm</EM>.

<UL>
<LI> Le fichier <EM>Xservers</EM> d&eacute;crits les serveurs X control&eacute;s par <EM>XDM</EM>.
Les terminaux X supportant de le protocole <EM>XDMCP</EM> ne <EM>doivent pas</EM>
figurer dans ce fichier. Le plus souvent, le fichier se r&eacute;duit &agrave; la description du
serveur X local (avec les options &eacute;ventuelles du serveur)
<PRE>
		
:0 local /usr/X11R6/bin/X 

</PRE>
<P>
<LI> Le fichier <EM>Xresources</EM> contient les ressource X concernant l'apparence
de la banni&egrave;re <EM>XDM</EM>
<PRE>

	xlogin*greeting: CLIENTHOST
	xlogin*namePrompt: login:\
	xlogin*fail: Login incorrect
	#ifdef COLOR
	xlogin*greetColor: CadetBlue
	xlogin*failColor: red
	*Foreground: black
	*Background: #fffff0
	#else
	xlogin*Foreground: black
	xlogin*Background: white
	#endif

</PRE>
<LI> Le fichier <EM>xdm-config</EM> contient d'autres ressources, principalement la
localisation des fichiers <EM>XDM</EM> et des consid&eacute;rations sur la s&eacute;curit&eacute;e et
les droits d'acc&egrave;s :
<PRE>
	DisplayManager.errorLogFile:    /usr/X11R6/lib/X11/xdm/xdm-errors
	DisplayManager.pidFile:         /usr/X11R6/lib/X11/xdm/xdm-pid
	DisplayManager.keyFile:         /usr/X11R6/lib/X11/xdm/xdm-keys
	DisplayManager.servers:         /usr/X11R6/lib/X11/xdm/Xservers
	DisplayManager.accessFile:      /usr/X11R6/lib/X11/xdm/Xaccess
	DisplayManager._0.authorize:    true
</PRE>
<LI> Le fichier <EM>Xsession</EM> est un shell-script ex&eacute;cut&eacute; lors de chaque session
(au login de de l'utilisateur). Par d&eacute;faut, <EM>Xsession</EM> recherche un fichier
<EM>.xsession</EM> sur le r&eacute;pertoire de l'utilisateur ($HOME) ainsi qu'un fichier
de ressources locales <EM>.Xresources</EM>. Si ces fichiers n'existent pas, une
session minimale est lanc&eacute;e :
<PRE>

	twm &
	exec xterm -geometry 80x24+10+10 -ls

</PRE>
Les erreurs de la session utilisateur sont redirig&eacute;es sur le fichier 
<EM>$HOME/.session-errors</EM>. Les erreurs g&eacute;n&eacute;rales du d&eacute;mon sont redirig&eacute;es
sur le fichier <EM>xdm-errors</EM> cit&eacute; dans le fichier <EM>xdm-config</EM>.
<P>
Voici un exemple de fichier <EM>.xsession</EM>
<PRE>
	# Configure le clavier fran&ccedil;ais
	xmodmap /usr/X11R6/lib/X11/Xmodmap.fr
	# Supprime le controle d'acc&egrave;s
	xhost +
	# Affiche la lune en fond d'&eacute;cran
	xphoon
	# D&eacute;marre mon window-manager favori
	fvwm &
	# Pendule
	xclock -g 100x100-10+10 &
	# Charge syst&egrave;me
	xload -g -120+10 &
	# XTerm principal
	exec xterm -name Pierre -fn 9x15 -g 80x24+10+10 -ls
</PRE>
<STRONG>ATTENTION</STRONG>
<P>
Le fichier <EM>.xsession</EM> doit &ecirc;tre <EM>ex&eacute;cutable</EM>. Dans la cas contraire,
le login par <EM>XDM</EM> ne pourra pas fonctionner :(
<P>

</UL>

<A NAME=3>
<H1>D&eacute;marrage du d&eacute;mon XDM</H1>

Le programme <EM>xdm</EM> peut &ecirc;tre lanc&eacute; &agrave; tout moment et devient automatiquement
un d&eacute;mon (pas de caract&egrave;re '&' n&eacute;cessaire) :
<PRE>

	# xdm 

</PRE>
Cependant, il est recommand&eacute; de le lancer &agrave; partir d'une fichier de d&eacute;marrage du
syst&egrave;me comme par exemple <EM>/etc/rc.d/rc.local</EM>
<PRE>

	...
	# XDM
	echo Starting the XDM daemon
	/usr/X11R6/bin/xdm
	...

</PRE>

<A NAME=4>
<H1>Les apports de XDM-Photo</H1>
<A NAME=41>
<H2>Introduction</H2>

Bien que les fonctionnalit&eacute;s de <EM>XDM</EM> soient sup&eacute;rieures &agrave; celle du simple
programme de lancement <EM>xinit</EM>, son aspect est extr&egrave;mement sobre (voire
&eacute;pur&eacute; !). C'est la raison pour laquelle un bon nombre de constructeurs fournissent
une version <EM>am&eacute;lior&eacute;e</EM> de <EM>XDM</EM> (Silicon Graphics, HP, SCO). Ces 
versions permettent en particulier le login d'un utilisateur par simple clic sur
une icone (par exemple leur photographie).
<P>
Une telle am&eacute;lioration n'est pas r&eacute;ellement difficile &agrave; r&eacute;aliser &agrave; partir des 
sources originaux car <EM>XDM</EM> utilise la librairie des <EM>X Intrinsics</EM>
(appel&eacute;e &eacute;galement <EM>Xt</EM>). 
<P>
Cette librairie, utilisant une approche <EM>objet</EM>, d&eacute;finit des classes de 
bases pour des <EM>widgets</EM> (en fait des objets graphiques comme des boutons, 
des conteneurs, des zones de saisie, etc..). La banni&egrave;re <EM>XDM</EM> elle-m&ecirc;me 
utilise un <EM>widget</EM> sp&eacute;cial appel&eacute; <EM>Login</EM> ce qui fait que la partie
graphique du programme <EM>xdm</EM> est compl&egrave;tement ind&eacute;pendante de la partie
syst&egrave;me.
<P>
Il suffit donc de modifier le <EM>widget Login</EM> pour modifier compl&egrave;tement
l'aspect du programme.

<A NAME=42>
<H2> Le widget Login modifi&eacute;</H2>

Au lieu de g&egrave;rer simplement un login et un mot de passe, le nouveau 
<EM>widget</EM>
construit une liste d'utilisateurs &agrave; partir du fichier <EM>/etc/passwd</EM> (et
&eacute;galement <EM>/etc/shadow</EM> si l'on utilise les <EM>shadow password</EM>). Pour
chaque nom d'utilisateur, le <EM>widget</EM> tente de trouver un fichier d'image 
associ&eacute; au nom sous la forme <EM>nom_login.xpm</EM> sur le r&eacute;pertoire
<EM>/usr/X11R6/lib/X11/xdm/pixmaps</EM>.

<P>
<IMG SRC="images/banner.gif">
<P>
Les fichiers d'images utilisent le format 
<A HREF="http://www.inria.fr/koala/lehors/xpm.html">XPM</A> d&eacute;velopp&eacute; par 
<A HREF="mailto:lehors@x.org">Arnaud Le Hors</A> et les membre du projet 
<A HREF="http://www.inria.fr/koala">Koala</A> pour la soci&eacute;t&eacute; 
<EM>Bull</EM>.
<P>
Si un fichier XPM existe, il est affich&eacute; dans la banni&egrave;re au dessus de votre nom, il
suffit donc de double-cliquer sur l'icone pour se loger (si on a un mot de passe, il 
faudra tout de m&ecirc;me utiliser le clavier pour le saisir...) .
<P>
Un exemple d'utilisation de <EM>XDM-photo</EM> est la cr&eacute;ation d'un login
d'arr&ecirc;t de la machine associ&eacute; &agrave; un login. Vous pouvez d&eacute;finir un login <EM>powerdown
</EM> dans <EM>/etc/passwd</EM>

<PRE>
	powerdown::0:0:Shutdown:/powerdown:/bin/sh
</PRE>
Le r&eacute;pertoire <EM>/powerdown</EM> doi contenir un fichier <EM>.profile</EM> du type
<PRE>
	echo Shutting down `hostname`...
	/etc/shutdown -rf now
</PRE>
Vous pouvez d'ores et d&eacute;ja arr&ecirc;ter votre PC en cliquant sur l'icone
<IMG SRC="images/on_off.gif" ALIGN=center>

<A NAME=43>
<H2>Nouvelles ressources</H2>

Voici une description des nouvelles ressources ajout&eacute;es a celles du <EM>widget Login</EM>
initial. Toutes ces ressources se affectent la classe <EM>Login</EM>.
<UL>
<LI> xlogin.Login.displayLogo<BR>
Affichage ou non du logo (LINUX). Le d&eacute;faut est <EM>True</EM>

<P>
<LI> xlogin.Login.displayUsers<BR>
Affichage ou non de la liste des utilisateurs. le d&eacute;faut est <EM>True</EM>. si cette 
cette ressource est <EM>False</EM>, la banni&egrave;re est similaire &agrave; celle de la version
originale de <EM>XDM</EM>.

<P>
<LI> xlogin.Login.useDefaultPixmap<BR>
Utilisation ou non du fichier <EM>default.xpm</EM> charg&eacute; si l'on ne trouve pas de 
<EM>nom_login.xpm</EM>. Le d&eacute;faut est <EM>False</EM>

<P>
<LI> xlogin.Login.userWidth<BR>
La largeur de la boite neglobante de chaque image et nom de login. Le d&eacute;faut est 90 
pixels.

<P>
<LI> xlogin.Login.userHeight<BR>
La hauteur de la boite neglobante de chaque image et nom de login. Le d&eacute;faut est 90
pixels.

<P>
<LI> xlogin.Login.userColor<BR>
La couleur utilis&eacute;e pour afficher le nom de login sous l'image. Le d&eacute;faut est 
<EM>black</EM>.

<P>
<LI> xlogin.Login.userFont<BR>
La fonte utilis&eacute;e pour afficher le nom de login sous l'image. Le d&eacute;faut est 
<EM>6x13</EM>.

<P>
<LI> xlogin.Login.nbColumns<BR>
Le nombre de colonnes de la liste d'utilisateurs affich&eacute;s. Le d&eacute;faut est 6.

<P>
<LI> xlogin.Login.nbLines<BR>
Le nombre de lignes de la liste affich&eacute;s. Le d&eacute;faut est 2. Si le nombre total 
d'utilisateurs &agrave; afficher est sup&eacute;rieur &agrave; <EM>nbLines * nbColumns</EM>, une barre de
d&eacute;filement (ascenceur) est affich&eacute;. Cependant, l'utilisation d'un ascenceur est p&eacute;nible
pour un grand nombre d'utilisateur et il convient donc de limiter les fichiers 
<EM>nom_login.xpm</EM> &agrave; quelques "happy few" :-). Dans le cas d'une station de travail
personnelle, le probl&egrave;me ne se pose pas.

</UL>

<A NAME=44>
<H2>Comment cr&eacute;er des pixmaps XPM</H2>

Les fichier <EM>nom_login.xpm</EM> peuvent &ecirc;tre cr&eacute;es en utilisant l'&eacute;diteur 
<EM>pixmap</EM> 
(&eacute;crit par <A HREF="mailto:Lionel.Mallet@sophia.inria.fr">Lionel 
Mallet</A>). Cet &eacute;diteur &agrave; une interface
similaire &agrave; celle de l'&eacute;diteur de bitmap X <EM>bitmap</EM>. Cependant, la cr&eacute;ation d'un
beau pixmap est une t&acirc;che ardue (surtout pour moi !) et il est beacoup plus facile de
modifier une image existante (digitalis&eacute;e &agrave; partir d'une photo r&eacute;elle) ou bien de
t&eacute;l&eacute;charger une icone de l'Internet. Une grande collection d'icones est disponible en
particulier sur :
<P>
<A HREF="ftp://server.berkeley.edu:/pub/AIcons">server.berkeley.edu:/pub/AIcons</A>
<P>
Si vous devez manipuler des images, vous pouvez utiliser le package <EM>Netpbm</EM> 
(anciennement <EM>PBM+</EM>) qui contient des convertisseurs de format XPM 
(<EM>xpmtoppm</EM> et <EM>ppmtoxpm</EM>). Une conversion typique d'un fichier GIF
en XPM avec r&eacute;duction &agrave; 8 couleurs sera:
<PRE>
giftoppm file.gif | ppmquant -8 | ppmtoxpm > file.xpm
</PRE>

Si vous disposez d'un display avec seulement 256 couleurs, il est tr&egrave;e important de
r&eacute;duire drastiquement le nombre de couleurs de chque icone afin de ne pas saturer la
table des couleurs.

<P>
Vous pouvez &eacute;galement utiliser <EM>xv-3.01</EM>, un superbe shareware &eacute;crit par
<A HREF="mailto:bradley@cis.upenn.edu">John Bradley</A> qui permet la manipulation et
la conversions entre divers formats d'images dont le XPM.
<P>
Une taille correcte pour un moniteur classique (15 ou 17") peut &ecirc;tre par exemple une
icone de 40x60 pixels.

<A NAME=5>
<H1>Comment compiler XDM-photo</H1>

<EM>XDM-photo</EM> est largement bas&eacute; sur la distribution source de <EM>XDM</EM>. La 
compilation se r&eacute;sume &agrave; 
<PRE>
	xmkmf
	make Makefiles
	make depend
	make 
	make install
	make install.man
</PRE>
J'utilise <EM>XDM-photo</EM> principalement sur <EM>LINUX</EM> avec 
<EM>XFree86-3.1.2</EM> mais &eacute;galement sur les architectures suivantes:
<UL>
<LI> SunOS 4.1.3/X11R5
<LI> Solaris-2.4/X11R6
<LI> SVR4/X11R5
</UL>

<A NAME=6>
<H1>Archives t&eacute;l&eacute;chargeables</H1>

Vous pouvez t&eacute;l&eacute;charger les produits suivants cit&eacute;s dans cet article:
<UL>
<LI> L'archive de 
<A HREF="archives/xdm-photo-1.1.1.tar.gz">Xdm-photo-1.1.1</A>

<LI> Les diff&eacute;rentes archives de 
<A HREF="ftp://ftp.ibp.fr:/pub/X11/XFree86/XFree86-3.1.2/binaries/Linux">XFree86-3.1.2 pour LINUX</A>

<LI> Les sources de la librairie
<A HREF="ftp://koala.inria.fr:/pub/xpm">XPM</A> 

<LI> L'&eacute;diteur 
<A HREF="ftp://koala.inria.fr:/pub/pixmap">PIXMAP</A>

<LI> Le package 
<A HREF="ftp://ftp.ibp.fr:/pub/X11/contrib/utilities/netpbm-1mar1994.tar.gz">Netpm-1mar1994</A>

<LI> L'archive de 
<A HREF="ftp://ftp.ibp.fr:/pub/X11/xv">Xv-3.10</A>
</UL>

</BODY>
