<html>
<head>
<title>
Probl&egrave;mes de fontes avec TeX sous Linux
</title>
</head>

<body>
<H1><IMG ALIGN=LEFT SRC="tex.gif" alt="TeX">
Probl&egrave;mes de fontes<BR>
avec TeX sous Linux
</H1>
<p>
Article pour l'Echo de Linux (<em><b>Juillet 1996</b></em>)
<address><a href="mailto:bayart@lep-philips.fr">Benjamin Bayart
(bayart@lep-philips.fr)</a></address>

<BR CLEAR=left>
<HR>

<p>
<H1> Sommaire </H1>
<UL>
<LI> 1 - <a href="#1">Soyez &agrave; jour</a></LI>
<LI> 2 - <a href="#2">Utilisez les versions officielles</a></LI>
<LI> 3 - <a href="#3">Corrigez le probl&egrave;me</a></LI>
<LI> 4 - <a href="#4">Comment refaire un fichier .tfm</a></LI>
<LI> 5 - <a href="#5">Comment refaire un fichier .fmt</a></LI>
</UL>
</p>

<HR>

<p>
Dans cet article, j'aimerais aborder deux probl&egrave;mes simples
concernant les fontes TeX. Le premier est un probl&egrave;me de date de
version, le second rel&egrave;ve plus du d&eacute;tournement involontaire de
copyright et les deux peuvent vous g&ecirc;ner.
</p>
<p>
Ces deux probl&egrave;mes sont d&eacute;crits chez
<A href="http://www-cs-faculty.stanford.edu/~knuth/cm.html">Knuth</A>
soi-m&ecirc;me.
</p>
<p><a name=1>
<H2>1 - Soyez &agrave; jour</H2>
</p>
<p>
Les fontes Computer Modern (les fontes standard sous TeX) ont &eacute;t&eacute;
l&eacute;g&egrave;rement am&eacute;lior&eacute;es durant le printemps 1992. Il semblerait
que les modifications n'aient pas &eacute;t&eacute; tout &agrave; fait assez
diffus&eacute;es au go&ucirc;t de Knuth, aussi, comme lui, je vous invite a
v&eacute;rifier que vos fontes sont suffisament r&eacute;centes.
</p>
<p>
Tapez donc un delta minuscule (en grande taille pour bien voir) dans
votre document, par exemple:
</p>
<blockquote>
{\huge $\delta$}
</blockquote>

<p>
Si vous voyez appra&icirc;tre
</p>
<center>
<img src="del1.gif" align=&auml;bsmiddle">
en lieu et place de
<img src="del2.gif" align=&auml;bsmiddle">
</center>

<p>
alors vos fontes sont trop vieilles, et il convient de les remplacer,
les nouvelles sont un poil plus jolies.
</p>
<p>
Ceci dit, cela me surprendrait grandement que l'on trouve des fontes
obsol&egrave;tes sur des distributions livr&eacute;es avec Linux (que ce soit
NTeX ou teTeX), mais il vaut mieux v&eacute;rifier; d'autre part, certains
d'entre vous utilisent peut-&ecirc;tre TeX ailleurs que sur leur machine
Linux. 
</p>

<p><a name=2>
<H2>2 - Utilisez les versions officielles</H2>
</p>

<p>
Pour ceux d'entre vous qui doivent renouveler leurs fontes &agrave; cause
du probl&egrave;me pr&eacute;c&eacute;dent, prenez garde a bien r&eacute;cup&eacute;rer les
bonnes versions des fontes. 
</p>

<p>
Pour les autres, une fois de plus, v&eacute;rifiez votre syst&egrave;me.
</p>

<p>
En effet, Knuth signale le probl&egrave;me comme suit
</p>


<p>
<it>
Somebody made unauthorized changes to the Computer Modern source files
in 1994 (i.e., to the METAFONT programs that define the Computer
Modern fonts), in direct violation of my stipulation on the copyright
page of Computers &amp; Typesetting, Volume E.
</it>
</p>

<p>
Ce probl&egrave;me touche pleinement la communaut&eacute; Linux puisque les
versions pirates des fontes ont &eacute;t&eacute; incorpor&eacute;es, par m&eacute;garde
n'en doutons pas, dans NTeX, donc dans la distribution Slackware, en
particulier celle de Mars 1995 (rien n'est pr&eacute;cis&eacute; pour les autres
ant&eacute;rieures ou post&eacute;rieures).
</p>

<p>
Dans ce cas pr&eacute;cis, il convient donc de v&eacute;rifier avec attention
les fontes install&eacute;es sur votre syst&egrave;me, pour ce faire, c'est
tr&egrave;s simple:
</p>

<pre>
Edgard~: tex
This is TeX, Version 3.1415 (C version 6.1)
**\setbox0 = \hbox{ho} \showbox 0
> \box0=
\hbox(6.94444+0.0)x10.55559
.\tenrm h
.\tenrm o

! OK.
<*> \setbox0 = \hbox{ho} \showbox 0

? x
No pages of output.
</pre>

<p>
Si TeX signale une largeur de bo&icirc;te diff&eacute;rente de 10.55559, alors
vous avez la version erron&eacute;e des fontes.
</p>

<p><a name=3>
<H2>3 - Corrigez le probl&egrave;me</H2>
</p>

<p>
Si vous avez des fontes trop vieilles, le probl&egrave;me est plut&ocirc;t
simple &agrave; r&eacute;soudre: effacer de votre disque dur tout ce qui touche
aux fontes Computer Modern (y compris les bitmaps), rapatrier les
derni&egrave;res versions depuis le site CTAN le plus proche (ou n'importe
quel CD pas trop vieux) et tout remettre en place. &Ccedil;a, c'est pas trop
compliqu&eacute;. 
</p>

<p>
Pour les miroirs CTAN en France, je connais
l'<A href="ftp://ftp.ibp.fr/pub/TeX/CTAN/fonts/cm">ibp</A> et le <A
href="ftp://ftp.loria.fr/pub/ctan/fonts/cm">loria</A>. 
</p>

<p>
Si vous avez les fontes pirates, par contre, le probl&egrave;me est tout
autre, en effet, non seulement il faut remplacer toutes les fontes
Computer Modern, mais &eacute;galement toutes celles qui sont construites
&agrave; partir d'elles (et elles sont nombreuses).
</p>

<p>
Bref, la meilleure et la plus rapide des m&eacute;thodes est encore de
d&eacute;sinstaller TeX et d'en installer un autre plus r&eacute;cent, par exemple
teTeX.
</p>

<p>
Ceci dit, si vous avez am&eacute;lior&eacute; longement et peti &agrave; petit votre
installation, par exemple en lui rajoutant un par un des packages ou
d'autre fontes, alors il conviendra plut&ocirc;t de choisir l'approche
suivante
<UL>
<LI> d&eacute;truire tous les fichiers .tfm du syst&egrave;me en relevant leurs
noms, sauf ceux produits par un autre syst&egrave;me que METAFONT, par
exemple ceux associ&eacute;s aux fontes PostScript ou TrueType,</LI>
<LI> d&eacute;truire les fichiers .fmt du syst&egrave;me en relevant leurs
noms,</LI> 
<LI> r&eacute;cup&eacute;rer les fichiers roman.mf, romlig.mf et punct.mf sur
n'importe quel miroir CTAN,</LI>
<LI> refaire tous les fichiers .tfm,</LI>
<LI> refaire les fichiers .fmt
</UL>
</p>

<p>
Les bitmaps des fontes, dixit Knuth, ne seraient pas affect&eacute;s par ces
d&eacute;fauts dans les fontes.
</p>

<p><a name=4>
<H2>4 - Comment refaire un fichier .tfm</H2>
</p>

<p>
Rappelons tout d'abord ce qu'est un fichier tfm. Un fichier tfm (pour
TeX Font Metric) est un fichier qui contient les dimensions tr&egrave;s
pr&eacute;cises de chacun des ceract&egrave;res ansi que les r&egrave;gles de
positionnement de ceux-ci. Ils sont calcul&eacute;s une et une seule fois
par fonte, par opposition aux fichiers pk (pour PacKed) qui
contiennent les bitmaps compress&eacute;s des fontes et sont donc
recalcul&eacute;s pour chaque r&eacute;solution.
</p>

<p>
Les fichiers de bitmaps et de m&eacute;trique sont g&eacute;n&eacute;r&eacute;s par
METAFONT lors d'une compilation, exactement comme les dvi sont
g&eacute;n&eacute;r&eacute;s par TeX.
</p>

<p>
Reste donc simplement &agrave; savoir lancer une compilation avec
METAFONT. C'est tr&egrave;s simple:
<pre>
mf "\mode:=cx; nonstopmode; input la_fonte"
rm -f la_fonte.log
rm -f la_fonte.300gf
</pre>
</p>

<p><a name=5>
<H2>5 - Comment refaire un fichier .fmt</H2>
</p>

<p>
Rappelons qu'un fichier fmt, un format, est produit par une version
sp&eacute;ciale de TeX qui s'appelle initex, cette version se comporte
comme le vrai TeX sauf qu'elle poss&egrave;de une primitive 
<tt>\dump</tt> qui permet de faire une copie de la m&eacute;moire
sur le disque. 
</p>

<p>
Il y a g&eacute;n&eacute;ralement deux fichier .fmt, celui de LaTeX:
<tt>latex.fmt</tt> et celui de TeX: <tt>tex.fmt</tt> ou
<tt>plain.fmt</tt>. 
</p>

<p>
Voyons d'abord comment refaire le format LaTeX:
<pre>
Edgard~:initex latex.ltx
[ beaucoup de bavardage ]
... dumped to latex.fmt
</pre>
</p>

<p>
Pour TeX, &ccedil;a va &ecirc;tre un tout petit peu plus complexe, mais pas
trop. En fait, l&agrave; aussi c'est bas&eacute; sur
<pre>
Edgard~:initex plain.tex
</pre>
mais il peut se produire que TeX demande un nom de fichier (s'il ne
trouve pas <tt>hyphen.tex</tt> normalement) il faudra alors lui donner
le nom du vrai fichier de c&eacute;sure anglophone sur votre syst&egrave;me (c'est
g&eacute;n&eacute;ralement <tt>UShyphen.tex</tt> ou quelque chose de ce go&ucirc;t
l&agrave;). 
</p>


</body>
</html>


