<HEAD>
<TITLE>
Utilisation de MIME sous Emacs
</TITLE>

<BODY>


<IMG SRC="images/sink11.xbm" ALIGN=left HSPACE=10> 
<H1> 
<P>Utilisation de MIME
<BR> sous GNU-Emacs
</H1>
<P>
Article pour l'Echo de Linux (<em><b>Juillet 1996</b></em>) 
<address><a href="mailto:pierre@rd.lectra.fr">Pierre Ficheux 
(pierre@rd.lectra.fr)</a></address> 

<BR CLEAR=left>
<HR>


<H1>R&eacute;sum&eacute;</H1>
Cet article indique comment installer et utiliser les composants permettant de
lire et d'&eacute;crire du courrier &eacute;lectronique au standard <EM>MIME</EM> avec 
<EM>GNU-Emacs</EM>. La lecture de cet article n&eacute;cessite d'&ecirc;tre familier avec
l'utilisation de <EM>GNU-Emacs</EM>.

<H1>Table des mati&egrave;res</H1>

<UL>
<LI><A HREF="#1"> 1 - Introduction</A>
<LI><A HREF="#2"> 2 - Manipuler le mail avec GNU-Emacs</A>
<LI><A HREF="#3"> 3 - Fonctionnement et installation de METAMAIL</A>
	<UL>
	<LI><A HREF="#31"> 3.1 - Principe de base</A>
	<LI><A HREF="#32"> 3.2 - Installation</A>
	</UL>
<LI><A HREF="#4"> 4 - Installation de TM</A>
<LI><A HREF="#5"> 5 - Composition et lecture de message MIME sous Emacs</A>
	<UL>
	<LI><A HREF="#51"> 5.1 - Composition d'un message MIME</A>
	<LI><A HREF="#52"> 5.2 - Quelques consid&eacute;ration sur le Quoted-Printable</A>
	<LI><A HREF="#53"> 5.3 - Lecture d'un message MIME</A>
	</UL>
<LI><A HREF="#6"> 6 - Conclusion</A>
</UL>



<A NAME=1>
<H1>Introduction</H1>

Le standard <EM>MIME</EM> (Multimedia Internet Mail Extensions) est le format 
officiel de transfert de donn&eacute;es multim&eacute;dias dans des courriers &eacute;lectroniques. Avec
le d&eacute;veloppement de l'Internet, il est de plus en plus fr&eacute;quent de vouloir transferer
des donn&eacute;es non texte &agrave; travers le r&eacute;seau, comme par exemple des images, des fichiers
audios ou bien des archives compress&eacute;es.
<P>
De nombreux produits commerciaux permettent de manipuler 
le format <EM>MIME</EM> comme par
exemple <EM>Z-Mail</EM> (d&eacute;velopp&eacute; initialement par <EM>Z-Code Software</EM>, 
aujourd'hui distribu&eacute; par NCD) ou bien le c&eacute;l&egrave;bre <EM>Netscape</EM> dont la 
version 2.0 contient un module de traitement de courrier &eacute;lectronique au format 
<EM>MIME</EM>. Le mailer <EM>Z-Mail</EM> est livr&eacute; en standard sur certains syst&egrave;mes
comme les <EM>Silicon Graphics</EM> ou bien sur la derni&egrave;re version du desktop
<EM>Caldera</EM> pour LINUX.
<P>
Le c&eacute;l&egrave;bre gratosware <EM>ELM</EM> est &eacute;galement capable de manipuler des
messages <EM>MIME</EM>.

<A NAME=2>
<H1>Manipuler le mail avec GNU-Emacs</H1>

<EM>GNU-Emacs</EM>, &eacute;diteur bien connu des utilisateurs de freeware, fournit un
module de manipulation de mail relativement agr&eacute;able &agrave; utiliser. La composition
d'un courrier se fait dans un buffer <EM>Emacs</EM> grace &agrave; la commande
<EM>C-x m</EM> (correspondant &agrave; la s&eacute;quence <EM>M-x mail</EM>). La version de base
de la distribution <EM>GNU-Emacs</H1> ne permet malheureusement pas de manipuler 
autre chose que du texte.
<P>
Pour manipuler du <EM>MIME</EM> avec <EM>GNU-Emacs</EM>, il est n&eacute;cessaire 
d'installer les packages suivants :
<UL>
<LI> Les utilitaires de 
<A HREF="archives/mm2.7.tar.gz">Metamail-2.7</A>
<LI> Le packages 
<A HREF="archives/tm-7.43.1.tar.gz">Tm-7.43.1</A>
</UL>
que vous pouvez t&eacute;l&eacute;charger en cliquant sur les r&eacute;f&eacute;rences ci-dessus.

<A NAME=3>
<H1>Fonctionnement et installation de METAMAIL</H1>

<A NAME=31>
<H2>Principe de base</H2>
<EM>Metamail</EM> a &eacute;t&eacute; initialement &eacute;crit par 
<A HREF="mailto:nsb@thumper.bellcore.com">Nathaniel S. Borenstein</A>.
Le programme <EM>metamail</EM> utilise un fichier <EM>mailcap</EM> (g&eacute;n&eacute;ralement
localis&eacute; sur le r&eacute;pertoire <EM>/usr/local/etc</EM>) indiquant le programme 
auxiliaire &agrave; utiliser pour visualiser un mail re&ccedil;u dans un format donn&eacute;.
<P>
Le type des donn&eacute;es du buffer de mail est indiqu&eacute; par le header 
<EM>Content-Type</EM>. Par exemple un mail contenant un header

<PRE>
Content-Type: audio/au
</PRE>
indique la pr&eacute;sence d'un fichier <EM>audio</EM> au format <EM>AU</EM> (utilis&eacute; en
particuli&eacute; sur les stations SUN ou sur LINUX). Le fichier <EM>mailcap</EM> indique
par la ligne
<PRE>
audio/au; showaudio %s
</PRE>
qu'un fichier de ce type sera exploit&eacute; par la commande <EM>showaudio</EM> qui sur
mon PC Linux se r&eacute;duit &agrave; un shell-script tr&egrave;s simple
<PRE>

root@pcpf # cat /usr/bin/showaudio
#!/bin/sh
cat $1 > /dev/audio

</PRE>

<A NAME=32>
<H2>Installation</H2>
La g&eacute;n&eacute;ration du package <EM>Metamail</EM> sur PC LINUX est extr&egrave;mement simple. Un
simple
<PRE>
#define LINUX
</PRE>
dans le fichier <EM>config.h</EM> indique au Makefile la configuration pour LINUX. Le
reste se reduit &agrave; <EM>make</EM> puis <EM>make install-all</EM> qui installe les
binaires et les pages manuels.

<A NAME=4>
<H1>Installation de TM</H1>

Le package <EM>Tm-7.43.1</EM> est d&eacute;velopp&eacute; par 
<A HREF="mailto:morioka@jaist.ac.jp">MORIOKA Tomohiko</A> et
<A HREF="mailto:shuhei@cmpt01.phys.tohoku.ac.jp">KOBAYASHI Shuhei</A>
et se compose principalement de fichiers <EM>Lisp</EM> Emacs (.el) destin&eacute;s &agrave; la
manipulation de mail au format <EM>MIME</EM>. La documentation en anglais et en 
japonais sous forme de fichiers <EM>.texi</EM> est &eacute;galement fournie.
<P>
Apr&egrave;s extraction de l'archives
<A HREF="archives/tm-7.43.1.tar.gz">tm-7.43.1.tar.gz</A>, il suffit de se positionner
dans le sous-r&eacute;pertoire <EM>tm</EM> et de suivre les instructions du fichier 
<EM>README.en</EM> qui comme son nom l'indique est en anglais et non en 
japonais, ouf :-)
<P>
L'archives t&eacute;l&eacute;chargeable &agrave; partir de cet article est configur&eacute;e pour une version
d'Emacs sup&eacute;rieure ou &eacute;gale &agrave; la <EM>19.29</EM> (la 19.30 est distribu&eacute;e avec la
distribution  LINUX <EM>Slackware-3.0</EM> et s'installe sur le r&eacute;pertoire 
<EM>/usr</EM> de l'arborescence LINUX). Ceux qui dispose d'une autre configuration 
doivent &eacute;diter le fichier <EM>config.tm</EM>.
<P>
Il est tout d'abord n&eacute;cessaire de compiler et d'installer quelques commandes &eacute;crites
en C par 
<PRE>
make all
</PRE>
puis
<PRE>
make install
</PRE>
La g&eacute;n&eacute;ration et l'installation des fichier Lisp se fait ensuite par
<PRE>
make install-19_29
</PRE>
L'archive est configur&eacute;e de mani&egrave;re &agrave; ce que les fichiers <EM>.el</EM> et 
<EM>.elc</EM> (Lisp compil&eacute;) soient install&eacute;s sur <EM>/usr/lib/emacs/site-lisp</EM>.
<P>
La g&eacute;n&eacute;ration de la documentation installable sur le r&eacute;pertoire <EM>/usr/info</EM>
se fait par :
<PRE>
cd doc
make info
</PRE>

<P>
<IMG SRC="images/warning_icon.gif">
Pour que le package install&eacute; soit pris en compte, vous devez ajouter la ligne
<PRE>
(load "mime-setup")
</PRE> 
dans votre fichier <EM>$HOME/.emacs</EM>.

<A NAME=5>
<H1>Composition et lecture de message MIME sous Emacs</H1>

<A NAME=51>
<H2>Composition d'un message MIME</H2>

L'ouverture d'un buffer de composition de mail par <EM>C-x m</EM> doit faire
apparaitre un nouveau menu intitul&eacute; <EM>MIME-Edit</EM> qui propose les options
de manipulation d'un buffer <EM>MIME</EM>
<P>
<IMG SRC="images/mime_menu.gif">
<P>
Pour ins&eacute;rer dans votre mail un fichier <EM>binaire</EM> (une image GIF par exemple),
il suffit de s&eacute;lectionner l'option <EM>Insert File</EM> (C-c C-x TAB) puis de choisir
le fichier avec Emacs. Apr&egrave;s confirmation du type de codage utilis&eacute; (en g&eacute;n&eacute;ral, 
<EM>MIME</EM> utilise le codage <EM>base64</EM>), Emacs ins&egrave;re le fichier cod&eacute; dans
votre buffer mail dans un identifieur appel&eacute; <EM>tag</EM>, comme indiqu&eacute; dans
l'exemple ci-dessous :
<PRE>
From: pierre@rd.lectra.fr (Pierre Ficheux)
Reply-To: pierre@rd.lectra.fr
To: truc@machin.fr
Subject: Test MIME Emacs
Mailer: GNU Emacs 19.30.1 (i486-slackware-linux, X toolkit) of Wed Nov 29 1995 on fuzzy
Organization: Cercle Linuxien pessacais : 4 avenue Mozart, Pessac, France
--text follows this line--

Ici j'ins&egrave;re une image du super programme MODARIS de Lectra-Syst&egrave;mes :)

--[[image/gif
Content-Disposition: inline; filename="modaris.gif"][base64]]...

</PRE>
Vous pouvez &eacute;galement ins&eacute;rer un enregistrement direct par <EM>Insert Voice</EM>
(C-c C-x v). Cet enregistrement utilise le device <EM>/dev/audio</EM> utilis&eacute; 
fr&eacute;quemment sur station <EM>SUN</EM> mais &eacute;galement disponible sous LINUX. Une fois
l'enregistrement termin&eacute; (par <EM>C-g</EM>) les donn&eacute;es cod&eacute;es sont int&eacute;gr&eacute;es dans
le buffer *mail* :
<PRE>
From: pierre@rd.lectra.fr (Pierre Ficheux)
Reply-To: pierre@rd.lectra.fr
To: truc@machin.fr
Subject: Test MIME Emacs
Mailer: GNU Emacs 19.30.1 (i486-slackware-linux, X toolkit) of Wed Nov 29 1995 on fuzzy
Organization: Cercle Linuxien pessacais : 4 avenue Mozart, Pessac, France
--text follows this line--

Ici j'ins&egrave;re un enregistrement

--[[audio/basic][base64]]
</PRE>

<A NAME=previsu>
<P>
Un option int&eacute;ressante est la possibilit&eacute; de "pr&eacute;-visualiser" votre buffer 
<EM>MIME</EM>
avant de l'exp&eacute;dier par l'option <EM>Preview Message</EM> (C-c C-x C-p). La m&eacute;thode 
de pr&eacute;-visualisation est identique &agrave; celle d&eacute;crite pour la 
<A HREF="#53">lecture</A> d'un courrier. 

<A NAME=52>
<H2>Quelques consid&eacute;rations sur le Quoted-Printable</H2>

Lorsque le module <EM>MIME</EM> est charg&eacute; par <EM>(load "mime-setup")</EM>,
le codage <EM>par d&eacute;faut</EM> du mail est le <EM>quoted-printable</EM> (ou QP), 
un codage tr&egrave;s populaire dans certains logiciels commerciaux ou nom (Eudora, 
Netscape, ...)
dont la particularit&eacute; est de rendre tr&egrave;s difficile &agrave; lire le message re&ccedil;u dans le
cas ou l'on ne dispose pas d'un mailer capable de d&eacute;coder le QP. L'exemple suivant,
dont les lectrices f&eacute;minimes voudront bien pardonner le cot&eacute; paillard (mais c'est
pour la bonne cause), met en &eacute;vidence le probl&egrave;me. Le message suivant :
<PRE>
Date: Sun, 7 Jul 1996 23:48:23 +0200
From: pierre@rd.lectra.fr (Pierre Ficheux)
Reply-To: pierre@rd.lectra.fr
To: pierre
Subject: Test QP
Mailer: GNU Emacs 19.30.1 (i486-slackware-linux, X toolkit) of Wed Nov 29 1995 on fuzzy
Organization: Cercle Linuxien pessacais : 4 avenue Mozart, Pessac, France
Mime-Version: 1.0 (generated by tm-edit 7.43)
Content-Type: text/plain; charset=ISO-8859-1
Content-Transfer-Encoding: quoted-printable

 
L'=E9t=E9, y'a des t=E9t=E9s =E0 admirer
</PRE>
est illisible. Par contre la m&ecirc;me chose en pur ISO-8859-1 :
<PRE>
Date: Sun, 7 Jul 1996 23:50:47 +0200
From: pierre@rd.lectra.fr (Pierre Ficheux)
Reply-To: pierre@rd.lectra.fr
To: pierre
Subject: Test QP2
Mailer: GNU Emacs 19.30.1 (i486-slackware-linux, X toolkit) of Wed Nov 29 1995 on fuzzy
Organization: Cercle Linuxien pessacais : 4 avenue Mozart, Pessac, France
Mime-Version: 1.0 (generated by tm-edit 7.43)
Content-Type: text/plain; charset=ISO-8859-1


L'&eacute;t&eacute;, y'a des t&eacute;t&eacute;s &agrave; admirer
</PRE>
est beaucoup plus sympathique. 
<P>
Dans le cas du module <EM>Tm-7.41.1</EM>, le codage QP est positionn&eacute; par d&eacute;faut
pour le texte cod&eacute; ISO-8859-1 (et pour d'autres codages) si l'on reste en mode
<EM>MIME</EM>. Il faut quitter le mode <EM>MIME</EM> (par <EM>C-c C-x C-z</EM>) pour
supprimer ce codage par d&eacute;faut (on revient en <EM>MIME</EM> par la commande
<EM>M-x mime-mode</EM>).
<P>
La correspondance est donn&eacute;e par la table suivante :

<PRE>
(defvar mime/charset-type-list
  '(("US-ASCII"       7 nil)
    ("ISO-8859-1"     8 "quoted-printable")
    ("ISO-8859-2"     8 "quoted-printable")
    ("ISO-8859-3"     8 "quoted-printable")
    ("ISO-8859-4"     8 "quoted-printable")
    ("ISO-8859-5"     8 "quoted-printable")
    ("KOI8-R"         8 "quoted-printable")
    ("ISO-8859-7"     8 "quoted-printable")
    ("ISO-8859-8"     8 "quoted-printable")
    ("ISO-8859-9"     8 "quoted-printable")
    ("ISO-2022-JP"    7 "base64")
    ("ISO-2022-KR"    7 "base64")
    ("EUC-KR"         8 "base64")
    ("ISO-2022-JP-2"  7 "base64")
    ("ISO-2022-INT-1" 7 "base64")
    ))
</PRE>
Pour supprimer le QP pour un ou plusieurs des codages, il suffit de re-d&eacute;finir cette
table dans votre fichier <EM>.emacs</EM> en rempla&ccedil;ant <EM>"quoted-printable"</EM>
par <EM>nil</EM>.
<PRE>
    ("ISO-8859-1"     8 nil)
</PRE>


<P>
<IMG SRC="images/warning_icon.gif">
La taille des donn&eacute;es cod&eacute;es est bien &eacute;videment importante par apport &agrave; un mail
texte classique. Comme de bien entendu , Emacs d&eacute;coupe les fichiers cod&eacute;s en
paquets de <EM>50 Ko</EM> en cas de transfert par un protocole type UUCP. Si vous 
d&eacute;sirez transf&eacute;rer votre courrier en un seul morceaux, vous devez le sp&eacute;cifier
par l'option <EM>About split</EM> du menu (et r&eacute;pondre <EM>No !</EM>).
<BR>
Notez que certains produits commerciaux (<EM>Netscape</EM> pour ne citer que lui
ne supporte pas les mail d&eacute;coup&eacute;s :( )


<A NAME=53>
<H2>Lecture d'un message MIME</H2>

Lorsqu'un message est affich&eacute; dans le buffer <EM>RMAIL</EM> (obtenu par 
<EM>M-x rmail</EM> ou bien l'option <EM>Read Mail</EM> du menu Emacs/Tools), on
peut visualiser les <EM>tags MIME</EM> par l'appui sur la touche <EM>v</EM> 
(M-x mime/viewer-mode) dans le buffer RMAIL. On obtient alors un buffer 
<EM>*Preview-RMAIL*</EM> de la forme suivante :
<PRE>
Date: Sun, 7 Jul 1996 17:29:29 +0200
From: pierre@rd.lectra.fr (Pierre Ficheux)
Reply-To: pierre@rd.lectra.fr
To: pierre
Subject: Essai
Mailer: GNU Emacs 19.30.1 (i486-slackware-linux, X toolkit) of Wed Nov 29 1995 on fuzzy
Organization: Cercle Linuxien pessacais : 4 avenue Mozart, Pessac, France
Mime-Version: 1.0 (generated by tm-edit 7.43)
Content-Transfer-Encoding: 7bit

[1  (text/plain)]

Voici la r&eacute;daction de l'"Echo de Linux"
[2 grotte3_1.gif (image/gif)]
</PRE>
Le buffer contient ici 2 tags (un texte d&eacute;ja visible et un image GIF). On peut 
visualiser la partie image en positionnant la souris (ou le curseur) sur le tag
num&eacute;ro 2 et en tapant de nouveau la touche <EM>v</EM> (ou bien en cliquant avec 
le bouton
central de la souris). On obtient alors le r&eacute;sultat suivant :
<P>
<IMG SRC="images/mime_mail.gif">
<P>
qui montre la r&eacute;daction de l'<EM>Echo de Linux</EM> en pleine relaxation apr&egrave;s le
dernier congr&egrave;s de Berlin :-)
<P>
La trace de traitement du message est affich&eacute;e dans le buffer <EM>*MIME-out*</EM>.
La m&eacute;thode est la m&ecirc;me si vous voulez 
<A HREF="#previsu">pr&eacute;-visualiser</A> un message <EM>MIME</EM> avant de l'exp&eacute;dier.
<P>
La touche <EM>e</EM> permet de sauvegarder un tag dans le fichier correspondant
(sous <EM>/tmp</EM>) comme le montre la trace du buffer <EM>*MIME-out*</EM> :
<PRE>
image/gif; base64 -> /tmp/grotte3_1.gif
/tmp/TMa00117 was removed.
extract to /tmp/grotte3_1.gif

Process tm-image finished
</PRE>
L'action sur la touche <EM>q</EM> supprime le buffer <EM>*Preview-RMAIL*</EM> et 
revient au buffer RMAIL normal.

<A NAME=7>
<H1>Conclusion</H1>

Ce package permet de transformer Emacs en un excellent utilitaire de manipulation
de message <EM>MIME</EM>. Pour une description compl&egrave;te des commandes  et des 
possibilit&eacute;s du package, je vous conseille vivement d'installer la documentation
en ligne au format <EM>info</EM>. Je tiens &agrave; remercier chaleureusement
<A HREF="mailto:soenen@qm.lectra.fr">Jean-Michel Soenen</A> de Lectra-Syst&egrave;mes
pour la d&eacute;couverte de ce package tr&egrave;s int&eacute;ressant sans lequel bien entendu, cet
article n'aurait jamais vu le jour.



</BODY>



