Repository: kaizenwa/Debian-1.3-Analysis
Catalog: debian-*-master/*/source/sound/mctools-lite-970129.orig/XMixer/po/*.po
Languages: de

source: Usage: %s [-all] [-debug] [-device <device>] [-nopoll] [-poll] [-rate <µsec>]
de: Benutzung: %s [-all] [-debug] [-device <device>] [-nopoll] [-poll] [-rate <µsec>]

source: %s: Too many arguments
de: %s: Zu viele Parameter

source: %s: mixerMode Resource and -0, -1 switch no longer supported.
de: %s: mixerMode Resource und -0, -1 Parameter werden nicht mehr unterstützt.

source: %s: Poll rate too low, using 1/3s.
de: %s: Abtastrate zu hoch, benutze 1/3s.

source: %s: Enabling all sliders.
de: %s: Alle Einstellregler aktiv.

source: %s: Can't open %s:
de: %s: Fehler beim öffnen von «%s»:

source: %s: Warning: Can't get a list of available mixer devices.
de: %s: Warnung: Liste von unterstützten Mixergeräten nicht ermittelbar.

source: %s: SOUND_MIXER_READ_DEVMASK returned 0x%08X
de: %s: SOUND_MIXER_READ_DEVMASK ergab 0x%08X

source: %s: Warning: Can't get a list of available recording sources.
de: %s: Warnung: Liste von unterstützten Aufnahmequellen nicht ermittelbar.

source: %s: SOUND_MIXER_READ_RECMASK returned 0x%08X
de: %s: SOUND_MIXER_READ_RECMASK ergab 0x%08X

source: %s: Warning: Can't get a list of stereo mixer devices.
de: %s: Warnung: Liste von unterstützten Stereogeräten nicht ermittelbar.

source: %s: SOUND_MIXER_READ_STEREODEVS returned 0x%08X
de: %s: SOUND_MIXER_READ_STEREODEVS ergab 0x%08X

source: %s: Warning: Can't read mixer capabilities.
de: %s: Warnung: Mixerfähigkeiten nicht ermittelbar.

source: %s: SOUND_MIXER_READ_CAPS returned 0x%08X
de: %s: SOUND_MIXER_READ_CAPS ergab 0x%08X

source: %s: Slider `%s' requested but NOT supported by driver.
de: %s: Regler `%s' angefordert aber NICHT vom Treiber unterstützt.

source: %s: Slider `%s' requested and supported by driver.
de: %s: Regler `%s' angefordert und vom Treiber unterstützt.

source: Exit
de: Ende

source: Guess what?
de: Drück mich!

source: Loudness
de: Physiologische Lautstärkeanpassung :-)

source: Stereo-wide
de: Stereo Basisverbreiterung

source: Mute
de: Ton aus

source: Can't set volume.
de: Kann Lautstärke nicht einstellen.

source: Can't read volume.
de: Kann Lautstärke nicht lesen.

source: Using braindead SOUND_MIXER_PRIVATEx command
de: Benutze hirnlosen SOUND_MIXER_PRIVATEx Befehl

source: Can't write flag.
de: Kann Schalter nicht einstellen.

source: Can't read flag.
de: Kann Schalter nicht lesen.

source: Recording source
de: Wird aufgenommen

source: Not recorded
de: Wird nicht aufgenommen

source: Can't access recording source.
de: Kein Zugriff auf Signalquelleneinstellung.
