<html> <head>
<title>Linux et le clavier Suisse romand</title>
</head>

<body>

<IMG SRC="swissarmy.gif" ALIGN=left HSPACE=10> 
<H1> 
<P>Linux et le clavier Suisse romand
</H1>
<P>
Article pour l'Echo de Linux (<em><b>Juillet 1996</b></em>) 
<address><a href="mailto:ferrez@dma.epfl.ch">Jean-Albert Ferrez
(ferrez@dma.epfl.ch)</a></address> 

<BR CLEAR=left>
<HR>


Allez, on redescend tout de suite sur terre, la Suisse romande n'est
pas si diff&eacute;rente des autres r&eacute;gions du globe, ni
m&ecirc;me des autres r&eacute;gions francophones. Simplement, il y a
quelques d&eacute;tails &agrave; changer par rapport &agrave; une
configuration franco-fran&ccedil;aise telle qu'on la trouve dans le <A
HREF="http://www.freenix.fr/linux/Guide/">Guide du ROOTard</A>,
principalement autour du clavier.

<ol>
<li><a href="#console">Le clavier Suisse romand en mode console</a>
<li><a href="#xfree">Le clavier Suisse romand sous X-Windows (XFree86)</a>
</ol>

<H2>G&eacute;n&eacute;ralit&eacute;s sur les claviers Suisse romands</H2>

<P>

Les PC vendus en Suisse sont en g&eacute;n&eacute;ral
&eacute;quip&eacute;s d'un clavier sp&eacute;cial, dont le plus proche
voisin est le clavier anglais QWERTZ (UK et non pas US), et assez
diff&eacute;rent du clavier fran&ccedil;ais AZERTY (Les mauvaises
langues diront que c'est le clavier fran&ccedil;ais qui est
diff&eacute;rent de tout ce qui existe, mais bon...) Sans entrer dans
des d&eacute;tails qui n'int&eacute;ressent que ceux qui les
connaissent d&eacute;j&agrave;, citons que l'on obtient directement ou
par un simple Shift la plupart des lettres accentu&eacute;es
&quot;simples&quot;, les tr&eacute;mas, circonflexes, aigu&euml;s et
graves, plus rares &eacute;tant simul&eacute;es par le truchement de
touches mortes, comme sur la machine &agrave; &eacute;crire de ma
grand-m&egrave;re.  Les symboles informatiques @ # [ ] { } ~
n&eacute;cessitent eux la touche Alt-Gr.

<P>

Un mot encore au sujet des caract&egrave;res accentu&eacute;s.  Nous
ne nous int&eacute;ressons ici qu'&agrave; leur saisie au clavier, pas
&agrave; leur affichage dans bash, tcsh, emacs, vi, truc ou autre. Ce
sujet est abondamment document&eacute;, entre autres dans le <A
HREF="http://www.freenix.fr/linux/Guide/">Guide du ROOTard</A>.

<a name="console">
<H2>Le clavier Suisse romand en mode console</H2>
</a>

<P>

C'est <TT>loadkeys</TT> qui se charge de changer la configuration du
clavier. Ce programme se trouve dans toute bonne distribution linux
dans <TT>/usr/bin/loadkeys</TT> et dans un package <TT>kbd-0.91</TT>
pour ceux qui font tout &agrave; la main. Il vient avec une liste de
fichiers de description de claviers, g&eacute;n&eacute;ralement
plac&eacute;e dans <TT>/usr/lib/kbd/keytables</TT>. C'est le
<TT>sf-latin1.map</TT> qui nous int&eacute;resse. Il suffit de faire
un petit

<PRE>
/usr/bin/loadkeys /usr/lib/kbd/keytables/sf-latin1.map
</PRE>

et on est tout bon (mettre cette ligne dans le fichier
<TT>/etc/rc.d/rc.local</TT>). Il y a aussi un <TT>sg-latin1.map</TT>
pour permettre &agrave; ceux qui tapent de temps en temps dans la
langue de Goethe sur clavier Suisse allemand de changer de clavier en
deux coups d'alias bien pens&eacute;s.

<H4>Pour aller plus loin</H4>

Les fichiers <TT>*.map</TT> sont de simples fichiers ASCII
&eacute;tablissant l'&eacute;quivalence entre le code d'une touche et
celui du caract&egrave;re devant appara&icirc;tre en fonction des
modificateurs (Shift, Alt-Gr,...). Il est donc tout &agrave; fait
possible de le modifier pour se concocter une version
personnalis&eacute;e. (Attention lors de mises &agrave; jour du
syst&egrave;me !)

<a name="xfree">
<H2>Le clavier Suisse romand sous X-Windows (XFree86)</H2>
</a>

Sous X11, c'est <TT>xmodmap</TT> qui se charge de la configuration du
clavier.  Il utilise lui aussi un fichier de description qui - on s'en
doute - n'est pas le m&ecirc;me que pour <TT>loadkeys</TT>.  Et comble
de malheur, X11 (ou en tout cas XFree86) ne vient pas avec une liste
de claviers pr&eacute;d&eacute;finis. Mais avant que <TT>xmodmap</TT>
n'entre en jeu, XFree86 - depuis la version 3.1.2 du moins - essaye
tout de m&ecirc;me de faire de son mieux en reprenant la configuration
du clavier sous la console et en fonction des param&egrave;tres des
<I>locale</I>. Mais il faut de toutes fa&ccedil;on touiller un peu :)

<H4>Les fichiers concern&eacute;s</H4>

<PRE>
<B>/usr/X11R6/lib/X11/locale/iso8859-1/Compose</B>
</PRE>

Ce fichier va trop loin &agrave; mon go&ucirc;t sur les points suivants :

<UL>
<LI>La touche ~ est une touche morte. Or d'une part les caract&egrave;res
compos&eacute;s avec une tilde sont rares en fran&ccedil;ais et
d'autre part ce caract&egrave;re est utilis&eacute; sous UNIX. 
<LI>Les autres touches mortes ´ ` ^ ¨ frapp&eacute;es deux fois de
suite ou suivies d'un espace ne donnent pas le caract&egrave;re
correspondant.
</UL>

Voici <a href="Compose">mon fichier</a> modifi&eacute;. On peut soit
remplacer purement et simplement le fichier original, soit mettre
cette version dans un fichier Compose.fr_CH, puis modifier
l'entr&eacute;e correspondante du fichier
<tt>/usr/X11R6/lib/X11/locale/compose.dir</tt>.

<PRE>
<B>Xmodmap</B>
</PRE>

Il est encore n&eacute;cessaire de changer quelques petites choses
&agrave; l'aide d'un fichier <a href="Xmodmap"><tt>Xmodmap</tt></a> :
Le tilde n'est pas une touche morte, par contre, avec shift il le
devient. Les guillemets typographiques fran&ccedil;aises ainsi que
divers caract&egrave;res sp&eacute;ciaux sont accessibles via la
touche Alt-Gr. On le charge soit avec un <TT>xmodmap
/usr/X11R6/lib/X11/xinit/.Xmodmap</TT> dans le <TT>xinit</TT> du
syst&egrave;me, soit avec un <TT>xmodmap ~/.Xmodmap</TT> depuis le
<TT>.xinit</TT> des utilisateurs, soit encore ailleurs. (Dans
certaines distributions, c'est fait par d&eacute;faut.)

<H4>Pour aller plus loin</H4>

La commande <tt>xev</tt> permet de voir les codes et symboles que le
serveur X associe &agrave; chaque touche du clavier.

La commande <tt>xmodmap -pke</tt> g&eacute;n&egrave;re le fichier
correspondant &agrave; la configuration actuelle. Il est ensuite
facile de le modifier. L&agrave; encore, il est tout &agrave; fait
possible de se faire plusieurs versions personnalis&eacute;es et d'en
changer &agrave; la vol&eacute;e, par exemple &agrave; l'aide d'un
pop-up menu du window manager.

<h2>Remarque finale</h2>

Les id&eacute;es et fichiers de configuration donn&eacute;s ici ne
refl&egrave;tent que ma vision personnelle du clavier Suisse romand et
de son utilisation. Je n'ai en particulier suivi aucune r&egrave;gle
ou norme officielle. De m&ecirc;me, ma mani&egrave;re de configurer le
serveur X peut ne pas plaire &agrave; tous... Je suis par contre
ouvert &agrave; toute suggestion ou information technique sur le
sujet.

<hr><address>Jean-Albert Ferrez  -  (<a href="mailto:ferrez@dma.epfl.ch">ferrez@dma.epfl.ch</a>)  -  <a href="http://dmawww.epfl.ch/roso.mosaic/jaf/home.html">Home Page</a><hr></address>
<!-- hhmts start -->
<font size=1>Mon Jul 22 11:26:33 1996<p></font>
<!-- hhmts end -->
</body> </html>
