<HTML>
<HEAD>
<TITLE>Quelques informations sur perl: O&ugrave; trouver de la documentation ?</TITLE>
</HEAD>
<BODY>
<A HREF="perl-2.html">Previous</A>
<A HREF="perl-4.html">Next</A>
<A HREF="perl.html#toc3">Table of Contents</A>
<HR>
<H2><A NAME="s3">3. O&ugrave; trouver de la documentation ?</A></H2>


<H2><A NAME="ss3.1">3.1 En ligne</A></H2>


<H3>Acc&egrave;s</H3>

<P>Depuis la version 5 de <EM>perl</EM> un effort particulier a &eacute;t&eacute; port&eacute; sur
la documentation en ligne. L'unique page de manuel <CODE>perl</CODE> a &eacute;t&eacute;
r&eacute;&eacute;crite et s&eacute;par&eacute;e en plusieurs fichiers, afin de faciliter sa
consultation. Pour voir les diff&eacute;rentes pages disponibles, il suffit
de rentrer la commande</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% man perl
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>ou encore, si les pages de manuel n'ont pas &eacute;t&eacute; install&eacute;es
correctement sur votre syst&egrave;me</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% perldoc perl
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Organisation</H3>

<P>Si l'on a l'intention de lire l'ensemble des pages (ce qui se fait
tr&egrave;s bien), il est conseill&eacute; de les lire dans l'ordre propos&eacute;. Si l'on
cherche la syntaxe d'une commande particuli&egrave;re, il faut consulter le
document <CODE>
<A HREF="http://www.perl.com/perl/doc/manual/html/perlfunc.html">perlfunc</A></CODE>. Pour une r&eacute;f&eacute;rence compl&egrave;te sur les
expressions r&eacute;guli&egrave;res, consulter le document <CODE>
<A HREF="http://www.perl.com/perl/doc/manual/html/perlre.html">perlre</A></CODE></P>

<H3>Documentation des modules</H3>

<P><EM>POD</EM>, un nouveau format de documentation a &eacute;t&eacute; introduit dans
<EM>perl5</EM>. Il signifie <EM>Plain Old Documentation</EM> et sa syntaxe est
d&eacute;crite dans le document <CODE>
<A HREF="http://www.perl.com/perl/doc/manual/html/perlpod.html">perlpod</A></CODE>.</P>
<P>C'est un format tr&egrave;s simple, ne disposant pas de grandes possibilit&eacute;s
mais largement suffisant pour &eacute;crire des pages de manuel. De nombreux
convertisseurs existent pour le convertir ensuite dans d'autres
formats: texte, nroff, LaTeX, html. On dispose ainsi d'une
documentation unique et facilement consultable quel que soit le moyen
dont on dispose.</P>
<P>Un autre de ses avantages est qu'il est pr&eacute;vu pour &ecirc;tre directement
int&eacute;gr&eacute; dans du code <EM>perl</EM>. Ainsi, la plupart des modules
contiennent leur propre documentation. Pour acc&eacute;der &agrave; la documentation
du module <CODE>File::Copy</CODE> par exemple, il suffit d'ex&eacute;cuter la commande </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% perldoc File::Copy
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Il est possible d'appliquer les convertisseurs du format <EM>POD</EM>
(<CODE>pod2txt</CODE>, <CODE>pod2html</CODE>, <CODE>pod2man</CODE>, <CODE>pod2html</CODE>) directement
sur les modules ou les scripts, afin d'en extraire cette documentation.</P>


<H2><A NAME="ss3.2">3.2 Sur le WWW</A></H2>

<P>J'ai d&eacute;j&agrave; parl&eacute; du site 
<A HREF="http://www.perl.com/">http://www.perl.com/</A>, qui contient
des pointeurs vers de la documentation en ligne ou vers divers livres
consacr&eacute;s &agrave; <EM>perl</EM>.</P>
<P>De nombreux tutoriaux, le plus souvent en anglais, sont &eacute;galement
disponibles. Il suffit de rentrer les termes de recherche <EM>perl</EM> et
<EM>tutorial</EM> dans un moteur de recherche pour les obtenir. Je ne peux
pas vraiment en conseiller un, &eacute;tant donn&eacute; que la documentation
standard de <EM>perl</EM> m'a toujours suffi.</P>


<H2><A NAME="ss3.3">3.3 De vrais livres</A></H2>

<P>De nombreux livres existent, du livre de r&eacute;f&eacute;rence au simple
tutorial. La liste la plus &agrave; jour de ces ouvrages est disponible sur
le site WWW 
<A HREF="http://www.perl.com/">http://www.perl.com/</A>, &agrave; l'URL 
<A HREF="http://www.perl.com/perl/info/books.html">http://www.perl.com/perl/info/books.html</A>.</P>
<P>Les ouvrages de r&eacute;f&eacute;rence, car &eacute;crits par Larry Wall, l'auteur du
langage, et d'autres sp&eacute;cialistes (Tom Christiansen, Randal
L. Schwartz), sont:</P>
<P>
<DL>

<DT><B>Programming Perl</B><DD><P>aussi appel&eacute; le <EM>Camel Book</EM> &agrave; cause de
l'image de dromadaire pr&eacute;sente sur sa couverture. C'est l'ouvrage de
r&eacute;f&eacute;rence pour <EM>perl</EM>. Une version est en cours de r&eacute;&eacute;criture pour
int&eacute;grer les nouvelles fonctionnalit&eacute;s de <EM>perl5</EM>. Sa date de
sortie est pr&eacute;vue pour septembre 1996.</P>

<DT><B>Learning Perl</B><DD><P>C'est un tutorial, couvrant uniquement les
possibilit&eacute;s de <EM>perl4</EM>. Une traduction fran&ccedil;aise est disponible.</P>

</DL>
</P>
<P><EM>(Attention, pub)</EM> J'ai &eacute;galement &eacute;crit un document d'introduction
&agrave; perl en fran&ccedil;ais, dont les versions Postscript et dvi sont
disponibles &agrave; l'adresse 
<A HREF="http://www-eleves.enst-bretagne.fr/~aubert/perl/">http://www-eleves.enst-bretagne.fr/~aubert/perl/</A>.</P>


<HR>
<A HREF="perl-2.html">Previous</A>
<A HREF="perl-4.html">Next</A>
<A HREF="perl.html#toc3">Table of Contents</A>
</BODY>
</HTML>
