<HTML>
<HEAD>
<TITLE>Quelques informations sur perl: Introduction</TITLE>
</HEAD>
<BODY>
Previous
<A HREF="perl-2.html">Next</A>
<A HREF="perl.html#toc1">Table of Contents</A>
<HR>
<H2><A NAME="s1">1. Introduction</A></H2>



<H2><A NAME="ss1.1">1.1 Pr&eacute;sentation</A></H2>

<P><EM>perl</EM> est un langage interpr&eacute;t&eacute; (avec une phase interne de
pr&eacute;-compilation) optimis&eacute; pour traiter des fichiers texte, mais qui
peut &eacute;galement &ecirc;tre utilis&eacute; pour diverses t&acirc;ches
d'administration-syst&egrave;eme.</P>
<P>Sa syntaxe s'inspire tr&egrave;s largement de celles de <EM>C</EM>, <EM>awk</EM>,
<EM>sed</EM> et <EM>sh</EM>, ce qui rend son apprentissage tr&egrave;s facile pour
toute personne ayant un peu d'exp&eacute;rience avec ces outils. N&eacute;anmoins,
pas d'affolement si vous ne les connaissez pas, vous pourrez appr&eacute;cier
certains concepts avec un oeil neuf.</P>
<P>Il n'y a aucune limitation sur la taille des donn&eacute;es ou sur leur
contenu (une cha&icirc;ne peut contenir le caract&egrave;re nul, et la gestion de
la m&eacute;moire qu'elle utilise n'est pas &agrave; la charge du programmeur).</P>
<P>Une grande quantit&eacute; de modules permet de lui ajouter rapidement
diverses extensions (CGI, Tk, Msql, POSIX, Curses, NNTP, etc).</P>
<P>Un des ses avantages est qu'il permet d'&eacute;crire rapidement des
applications puissantes qui peuvent tourner imm&eacute;diatement sur
plusieurs plates-formes diff&eacute;rentes.  Son utilisation va donc du
prototypage rapide d'applications au d&eacute;veloppement complet de
programmes divers et portables.</P>


<H2><A NAME="ss1.2">1.2 Historique</A></H2>

<P><EM>perl</EM> a &eacute;t&eacute; con&ccedil;u en 1987 par Larry Wall.  C'est &agrave; la m&ecirc;me
personne que l'on doit le lecteur de news <CODE>rn</CODE> ainsi que
l'utilitaire <CODE>patch</CODE>, bien connu des Linuxeurs/iens/istes.  Il
avait besoin &agrave; l'&eacute;poque de g&eacute;n&eacute;rer des rapports sur le trafic engendr&eacute;
par un syst&egrave;me analogue aux News actuelles, et les outils dont il
disposait &agrave; l'&eacute;poque &eacute;taient soit pas assez puissants, soit pas assez
souples.</P>
<P>Il a donc con&ccedil;u un langage adapt&eacute; &agrave; ses besoins, c'est-&agrave;-dire capable
d'analyser des donn&eacute;es textuelles pour concevoir des rapports, d'o&ugrave;
l'acronyme utilis&eacute;: <EM>Practical Extraction and Report
Language</EM>. Cette signification <EM>politiquement correcte</EM> n'est
apparue, d'apr&egrave;s le folklore, qu'apr&egrave;s le terme plus pr&eacute;cis:
<EM>Pathologically Eclectic Rubbish Lister</EM>.</P>
<P>Ayant mis sa cr&eacute;ation &agrave; disposition d'autres personnes, il a ensuite
int&eacute;gr&eacute; de nombreuses fonctionnalit&eacute;s (appels syst&egrave;mes, etc) qui lui
&eacute;taient demand&eacute;es, ce qui a conduit le langage a &ecirc;tre utilis&eacute; par de
nombreux administrateurs-syst&egrave;me.</P>


<H2><A NAME="ss1.3">1.3 Probl&egrave;me de version ?</A></H2>

<P>Ces derniers temps ont vu une nouvelle source de probl&egrave;mes &eacute;merger
dans la communaut&eacute; <EM>perl</EM>, &agrave; l'occasion de la sortie de la version
5 du langage. La version pr&eacute;c&eacute;dente, g&eacute;n&eacute;ralement 4.036, &eacute;tait alors
utilis&eacute;e depuis quelques ann&eacute;es, quand la nouvelle version est
sortie. Celle-ci apporte de nombreuses am&eacute;liorations, directement
visibles ou plus internes, tout en restant compatible avec les
anciennes versions du langage (il faut noter que certains scripts
&eacute;crits pour <EM>perl</EM> version 1 fonctionnent encore sans changement
avec la version actuelle).</P>
<P>La compatibilit&eacute; n'est cependant pas totale : un certain nombre
d'incompatibilit&eacute;s mineures ont &eacute;t&eacute; introduites et peuvent obliger &agrave;
reprendre certains scripts. L'exemple le plus courant est le fait que
le caract&egrave;re <CODE>@</CODE> doit maintenant &ecirc;tre pr&eacute;c&eacute;d&eacute; d'un <EM>backslash</EM>
&agrave; l'int&eacute;rieur d'une cha&icirc;ne de caract&egrave;res, afin que le <CODE>@</CODE> ne soit
pas interpr&eacute;t&eacute; comme un pr&eacute;fixe de tableau.</P>
<P>L'ensemble des incompatibilit&eacute;s, ainsi que les pi&egrave;ges les plus
courants pour les personnes utilisant <EM>C</EM> ou <EM>awk</EM> sont
pr&eacute;sent&eacute;s dans la page de manuel <CODE>
<A HREF="http://www.perl.com/perl/doc/manual/html/perltrap.html">perltrap</A></CODE></P>
<P>Cet article est consacr&eacute; principalement &agrave; <EM>perl5</EM>, et plus
sp&eacute;cifiquement <EM>perl5.003</EM> ou sup&eacute;rieur. Cette derni&egrave;re version est
en effet celle qui est la plus pratique &agrave; utiliser ou installer, et la
seule activement maintenue.</P>


<H2><A NAME="ss1.4">1.4 Qu'apporte perl5 par rapport &agrave; la version pr&eacute;c&eacute;dente ?</A></H2>

<P>Voil&agrave; quelques unes des am&eacute;liorations les plus &eacute;videntes:</P>
<P>
<UL>
<LI>des 
<A HREF="http://www.perl.com/perl/doc/manual/html/perldsc.html">structures de donn&eacute;es complexes</A>, gr&acirc;ce &agrave; l'introduction des
<A HREF="http://www.perl.com/perl/doc/manual/html/perlref.html">r&eacute;f&eacute;rences</A> ;
</LI>
<LI>une approche orient&eacute;e-objet, dont l'int&eacute;r&ecirc;t n'est pas simplement
acad&eacute;mique: elle a permis en effet le d&eacute;veloppement de divers
<A HREF="perl-4.html#modules">modules</A> rendant l'&eacute;criture des
scripts encore plus simple et plus rapide ;
</LI>
<LI>les 
<A HREF="http://www.perl.com/perl/doc/manual/html/perlre.html">expressions r&eacute;guli&egrave;res</A> sont maintenant plus puissantes, et
la possibilit&eacute; est offerte de placer des commentaires &agrave; l'int&eacute;rieur,
afin d'expliquer leur fonctionnement ;
</LI>
<LI>la possibilit&eacute; d'ajouter facilement de nouvelles fonctionnalit&eacute;s
venant de librairies C gr&acirc;ce au langage d'extension <EM>XS</EM> (voir les
pages de manuel <CODE>
<A HREF="http://www.perl.com/perl/doc/manual/html/perlxs.html">perlxs</A></CODE>
et <CODE>
<A HREF="http://www.perl.com/perl/doc/manual/html/perlxstut.html">perlxstut</A></CODE>).
</LI>
</UL>
</P>


<HR>
Previous
<A HREF="perl-2.html">Next</A>
<A HREF="perl.html#toc1">Table of Contents</A>
</BODY>
</HTML>
