<HTML>
<HEAD>
<TITLE>Quelques informations sur perl: Informations compl&eacute;mentaires</TITLE>
</HEAD>
<BODY>
<A HREF="perl-3.html">Previous</A>
Next
<A HREF="perl.html#toc4">Table of Contents</A>
<HR>
<H2><A NAME="s4">4. Informations compl&eacute;mentaires</A></H2>

<P>Dans cette section se trouvent - pour l'instant - des informations
pouvant &ecirc;tre utiles aux personnes d&eacute;sirant installer des
modules. D'autres informations plus sp&eacute;cifiques pourront y &ecirc;tre
ajout&eacute;es, sur demande.</P>

<H2><A NAME="modules"></A> <A NAME="ss4.1">4.1 Installation de modules</A></H2>

<P>L'introduction des modules et du langage d'extension <EM>XS</EM> a
grandement facilit&eacute; la vie des programmeurs ainsi que des
utilisateurs.  Un m&eacute;canisme (<CODE>MakeMaker</CODE>) a &eacute;t&eacute; d&eacute;velopp&eacute; afin de rendre
l'installation de nouveau modules la plus simple possible. J'en
parlerai ici du point de vue de la personne qui doit installer un
nouveau module. Ce que je d&eacute;cris est valable surtout pour les syst&egrave;mes
g&eacute;rant les librairies dynamiques. La marche &agrave; suivre pour les autres
syst&egrave;mes (librairies statiques) est presque identique mais impose de
recompiler une nouvelle version de l'interpr&eacute;teur <CODE>perl</CODE>. </P>

<H3>D&eacute;marche g&eacute;n&eacute;rale</H3>

<P>Voyons dans un premier temps la d&eacute;marche g&eacute;n&eacute;rale, adapt&eacute;e pour tous
les modules simples. Apr&egrave;s avoir d&eacute;tarr&eacute; l'archive du module et &ecirc;tre
all&eacute; dans le r&eacute;pertoire ainsi cr&eacute;&eacute;, il suffit de proc&eacute;der ainsi:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% less README
% less INSTALL
% perl Makefile.PL
% make
% make test
% make install
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Un exemple plus d&eacute;velopp&eacute;</H3>

<P>Prenons l'exemple du module <EM>Curses</EM> qui procure des routines
permettant de g&eacute;rer la gestion d'un &eacute;cran en mode texte. Il ne vient
pas avec la distribution standard de <EM>perl</EM>, il faut donc aller le
r&eacute;cup&eacute;rer sur un des sites 
<A HREF="perl-2.html#CPAN">CPAN</A> ; il se trouve
dans la cat&eacute;gorie <EM>User Interfaces</EM>.</P>
<P>Il faut ensuite d&eacute;tarrer le fichier archive rapatri&eacute; dans un
r&eacute;pertoire quelconque. Rappelons aux utilisateurs de Linux qu'il est
d&eacute;conseill&eacute; de compiler quoi que ce soit en &eacute;tant root : mieux vaut le
faire en tant qu'utilisateur normal, puis passer root pour faire
l'installation uniquement.</P>
<P>Dans le r&eacute;pertoire <CODE>Curses-1.0</CODE> ainsi cr&eacute;&eacute; se trouvent plusieurs
fichiers et r&eacute;pertoires dont nous allons voir les plus importants.</P>
<P>En premier lieu, bien lire les fichiers <CODE>README</CODE> et
<CODE>INSTALL</CODE>. La marche &agrave; suivre y est indiqu&eacute;e. Dans le cas de
<EM>Curses</EM> qui est un paquetage variant beaucoup d'une machine &agrave;
l'autre, il faut copier &agrave; la main le fichier du r&eacute;pertoire <CODE>hints</CODE>
correspondant &agrave; son architecture dans le fichier <CODE>c-config.h</CODE> et
&eacute;diter le fichier <CODE>Makefile.PL</CODE> pour d&eacute;commenter les lignes
relatives &agrave; son syst&egrave;me d'exploitation.</P>
<P>Je vous rassure, <EM>Curses</EM> fait partie des modules impliquant le
plus de manipulations. Dans la plupart des cas, comme par exemple pour
<EM>GD</EM> ou <EM>Msql</EM>, il suffit d'avoir auparavant install&eacute; les
librairies ad&eacute;quates sur son syst&egrave;me si elles n'y &eacute;taint pas d&eacute;j&agrave;.</P>
<P>Il faut ensuite lancer la commande 
<BLOCKQUOTE><CODE>
<PRE>
% perl
Makefile.PL
</PRE>
</CODE></BLOCKQUOTE>
 qui va faire un certain nombre de tests
et cr&eacute;er le fichier <CODE>Makefile</CODE>.  Un simple <CODE>make</CODE> doit ensuite
suffire &agrave; construire l'extension.</P>
<P><CODE>% make test</CODE> lance une s&eacute;rie de tests afin de v&eacute;rifier que le module
est correctement compil&eacute;. Il suffit enfin de passer root pour faire le
<CODE>% make install</CODE> qui ira installer les fichiers n&eacute;cessaires dans les
bons r&eacute;pertoires (g&eacute;n&eacute;ralement,
<CODE>/usr/local/lib/perl5/site_perl/</CODE> ou
<CODE>/usr/lib/perl5/site_perl/</CODE>).</P>


<H2><A NAME="ss4.2">4.2 Comment installer un module sans avoir les droits root ?</A></H2>

<P>Les modules sont install&eacute;s par d&eacute;faut dans le r&eacute;pertoire standard des
librairies de <EM>perl</EM>. Si vous avez besoin d'un module mais que vous
n'avez pas les droits sur l'arborescence <CODE>/usr/local</CODE>, il est
toujours possible d'installer des modules dans votre r&eacute;pertoire
personnel, en pr&eacute;cisant pour cela le r&eacute;pertoire ad&eacute;quat lors de la
g&eacute;n&eacute;ration du fichier <CODE>Makefile</CODE>:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% perl Makefile.PL PREFIX=~
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>ce qui va installer les modules dans le r&eacute;pertoire <CODE>$HOME/lib</CODE>.
Pour y acc&eacute;der, il suffit de commencer le script par:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
#!/usr/local/bin/perl

use lib &quot;$ENV{HOME}/lib&quot;;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La documentation compl&egrave;te des attributs d'installation pouvant &ecirc;tre
fix&eacute;s est disponible par la commande:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% perldoc ExtUtils::MakeMaker
</PRE>
</CODE></BLOCKQUOTE>
</P>


<HR>
<A HREF="perl-3.html">Previous</A>
Next
<A HREF="perl.html#toc4">Table of Contents</A>
</BODY>
</HTML>
