Repository: kaizenwa/Debian-1.3-Analysis
Catalog: debian-*-master/*/source/comm/dialdcost-0.1/po/*.po
Languages: is

source: Try '%s --help' for further information
is: Reyndu '%s --help' fyrit ýtarlegri upplýsingar

source: Usage: %s ARGUMENTS
is: Notkun: %s FLAGG

source: Collects the output from DIALD log file, and calculates the estimated cost for the connection made. -f, --file=FILE Data comes from FILE -u, --unit=UNIT Each cost unit is UNIT seconds -c, --cost=COST Each unit cost COST -s, --scratch Scratch all setup, use built-in values -t, --time=BEG-END Mark cost for period BEG-END --verbose Be verbose, not just the calculated total --help Show this help, and exit --version Show version information, and exit If -f argument is not used, the data is read from /var/log/diald.log as default. If the argument given with '-f' is '-', then stdin is read.
is: Tekur saman úrtak frá DIALD log skrá, og reiknar út tengitíman sem er skráður ásamt kostnaði tengingarinnar. -f, --file=SKRÁ Gögn eru tekin úr SKRÁ -u, --unit=STAK Hvert stak telur STAK sekúndur -c, --cost=KOSTN Hvert stak kostar KOSTN krónur -s, --scratch Eyða burtu öllum stillingum, nota innbyggð gildi -t, --time=BYR-END Merkja að kostnaðartímabil BYRjun - ENDir --verbose Segja frá heildartíma, ásamt kostnaði --help Sýna þessa aðstoð, og hætta --version Sýna útgáfu og hætta Ef -f flagg er ekki gefið, þá eru gögn lesin úr /var/log/diald.log að óbreittu. Ef nafnið með '-f' er '-', þá er lesið frá stöðluðu inntaki.

source: ERROR: near <%d:%s>
is: VILLA: nærri <%d:%s>

source: Error opening %s
is: Villa við opnun %s

source: PANIC: out of memory
is: PANÍK: Minni er þrotið

source: ERROR: %s
is: VILLA: %s

source: Memory exhausted.
is: Minni þrotið

source: Time format malformed
is: Tíma setning er ógild

source: In file %s, unknown keyword %s
is: Í skrá %s, lykilorð %s er óþekkt

source: Syntax near %s, expecting %c
is: Mál villa nærri %s, bjóst við %c

source: Too few arguments
is: Of fá argument

source: DIALD cost report (V 0.1) program
is: DIALD kostnaðar (V 0.1) skýrsluforrit

source: Duration on calls %d:%d:%d seconds.
is: Tími tengingar %d:%d:%d sekúndur.

source: Total amount %.2f
is: Heildar upphæð %.2f
