<!--        Article sur majordomo         -->
<!-- (c) Eric Dumas 1996 dumas@freenix.fr -->

<html>
  <head>
    <title>Majordomo</title>
  </head>

<body>
<h1> <IMG ALIGN=CENTER SRC="mail.gif"> Majordomo</h1>
<p>
Article pour l'Echo de Linux (<em><b>Juillet 1996</b></em>) 
<address><a href="mailto:dumas@freenix.fr">Eric Dumas (dumas@freenix.fr)</a></address> 
<HR>
<h1><IMG ALIGN=CENTER SRC="main.gif"><em>R&eacute;sum&eacute;</em></h1>

	Le but de cet article est de pr&eacute;senter l'outil <b>majordomo</b>
qui permet de g&eacute;rer des listes de courrier &eacute;l&eacute;ctronique d'une mani&egrave;re 
automatique. Cet outil &eacute;crit en langage perl permet d'administrer 
tr&egrave;s simplement ces listes, avec une intervention minimale de la part
de l'administrateur. 
<p>
      Cet article pr&eacute;sentera successivement l'installation, la 
configuration et enfin l'utilisation de cet outils. Les exemples 
pr&eacute;sent&eacute;s sont des exemples r&eacute;els pris &agrave; partir de la mailing 
liste du journal. 

<hr>

<h1> Sommaire</h1>
<ul>
	<li>1 - <a href="#1">Outils requis</a></li>
	<li>2 - <a href="#2">Installation et Configuration</a></li>
	<ul>
		<li> 2.1 - <a href="#21">Compilation</a></li>
		<li> 2.2 - <a href="#22">Installation</a></li>
		<li> 2.3 - <a href="#23">Configuration</a></li>
	</ul>
	<li> 3 - <a href="#3">Utilisation</a></li>
	<li> 4 - <a href="#4">Cr&eacute;ation d'une liste</a></li>
	<ul>
		<li> <a href="#41">Aliases</a></li>
		<li> <a href="#42">Configuration</a></li>
	</ul>	
	<li> <a href="#5">R&eacute;f&eacute;rences</a></li>
</ul>

<hr>

<a name=1>
<h1><IMG ALIGN=CENTER SRC="main.gif">1 - Outils requis</h1>

      Pour installer <b>majordomo</b>, il est n&eacute;cessaire de r&eacute;cup&eacute;rer
l'archive <em>majordomo-1.93.tar.gz</em> (c'est la derni&egrave;re version
&agrave; l'heure ou j'&eacute;cris ces mots). Le site principal est 
<a href="ftp://ftp.greatcircle.com/pub/majordomo/">ftp://ftp.greatcircle.com/pub/majordomo/</a>. 
Toutefois, il existe de nombreux miroirs en France dont 
<a href="ftp://ftp.ibp.fr/pub/unix/mail/majordomo/">ftp://ftp.ibp.fr/pub/unix/mail/majordomo/</a>. 
<p>
      Une fois l'archive r&eacute;cup&eacute;r&eacute;e, il est n&eacute;cessaire (outre le
fait d'avoir un compilateur C) de poss&eacute;der Perl install&eacute;e. 
Enfin effet, <b>majordomo</b> est &eacute;crit en Perl (version 4.036). 
Il devrait &eacute;galement fonctionner 
avec les versions 5.001a et sup&eacute;rieure toutefois, il ne fonctionnera
 pas 
avec la version <b>5.001</b>. Si vous utilisez <b>majordomo</b>
avec une version 5 de Perl, il faut modifier les sources 
en raison d'une incompatibilit&eacute;. Le principe de mettre <tt>\@</tt>
&agrave; la place de <tt>@</tt> dans les cha&icirc;nes de caract&egrave;res. L'op&eacute;ration
&eacute;tant assez p&eacute;nible &agrave; effectuer, j'ai fait un petit patch. Pour le
r&eacute;cup&eacute;rer, <a href="patch-majordomo">cliquer ici</a>.
<p>
      Si vous ne poss&eacute;dez pas <b>perl</b>, vous pouvez le r&eacute;cup&eacute;rer
sur son site majeur 
<a href="ftp://ftp.netlabs.com/pub/outgoing/perl5.0">ftp.netlabs.com/pub/outgoing/perl5.0</a>. 
La derni&egrave;re version est la 5.003 et semble fonctionner (la liste cr&eacute;e pour ce 
journal tourne avec !).

<a name=2>
<h1><IMG ALIGN=CENTER SRC="main.gif">2 - Installation et Configuration</h1>

      Une fois perl install&eacute; et apr&egrave;s que l'archive ait &eacute;t&eacute; d&eacute;sarchiv&eacute;e, il
ne nous reste plus qu'&agrave; compiler puis installer <b>majordomo</b>. 

<a name=21>
<h2>2.1 - Compilation</h2>

      Il est n&eacute;cessaire de compiler le programme <em>wrapper</em>, qui est 
charg&eacute; de lancer les diff&eacute;rents programmes perl. Il suffit d'&eacute;diter le 
fichier Makefile et de configurer les chemins d'acc&egrave;s, etc. Je vous
conseille d'installer <b>majordomo</b> dans le r&eacute;pertoire 
<tt>/usr/local/mail/majordomo</tt>. De m&ecirc;me, il est conseill&eacute; 
de sp&eacute;cifier que le fichier de configuration de <b>majordomo</b>
soit dans ce r&eacute;pertoire plut&ocirc;t que dans <tt>/etc</tt>.

<a name=22>
<h2>2.2 - Installation</h2>

      Pour effectuer l'installation, passer en super-utilisateur et lancer
<tt>make install</tt>. Tous les programmes seront install&eacute;s dans le
r&eacute;pertoire que vous avez sp&eacute;cifi&eacute;.

      L'installation des programmes est termin&eacute;e. Il ne reste plus 
qu'&agrave; configurer l'outil, ce qui n'est pas forc&eacute;ment une simple
affaire. 

<a name=23>
<h2>2.3 - Configuration</h2>

      L'op&eacute;ration de configuration est assez simple. Il suffit d'adapter
le fichier <tt>sample.cf</tt> en fonction de la configuration locale.
Il est ensuite n&eacute;cessaire de le sauvegarder sous le nom de 
<tt>majordomo.cf</tt>.
<p>
Voila, <b>majordomo</b> est pr&ecirc;t... enfin presque ! Une fois les programmes
install&eacute;s, et <b>majordomo</b> configur&eacute;, il est ensuite n&eacute;cessaire d'effectuer
certaines op&eacute;ration d'administration syst&egrave;me :
<ul>
	<li> cr&eacute;er un utilisateur <em>majordom</em> (sans o car 8 caract&egrave;res maximum),
sans home directory :
<pre>
majordom:*:1000:501:Majordomo:/usr/local/mail:/dev/null
</pre></li>
        <li> &eacute;diter le fichier <tt>/etc/aliases</tt>, et y rajouter :
<pre>
#
# Mailing list 
#
majordomo: "|/usr/local/mail/majordomo/wrapper majordomo"
owner-majordomo: postmaster
majordomo-owner: postmaster
</pre> </li>
</ul>

	Le principe est que tout mail envoy&eacute; &agrave; <b>majordomo</b> est
automatiquement trait&eacute; par le programme. Wrapper n'est l&agrave; que 
pour redistribuer le message en tout s&eacute;curit&eacute;.

<a name=3>
<h1><IMG ALIGN=CENTER SRC="main.gif"> 3 - Utilisation</h1>

      Bien... c'est pr&ecirc;t. Envoyons notre premier courrier &eacute;lectronique :
<pre>
gandalf# mail majordomo
Subject:
help
</pre>

      Quelques instants plus tard, vous allez recevoir la liste des commandes
que vous pouvez utiliser. Voici une description des commandes utilisables
(les champs entre crochets sont optionnels) :
<ul>
	<li> subscribe Nom_Liste [email] : pour souscrire &agrave; une liste;</li>
	<li> unsubscribe Nom_Liste [email] : pour se retirer d'une liste;</li>
	<li> get Nom_Liste Nom_Fichier : permet de r&eacute;cup&eacute;rer des fichiers mis 
&agrave; la disposition des utilisateurs de la liste;</li>
	<li> index Nom_Liste : donne la liste des fichiers qui peuvent &ecirc;tre 
r&eacute;cup&eacute;r&eacute;s par la liste;</li>
	<li> which [email] : indique dans quelles liste vous &egrave;tes inscrit;</li>
	<li> who Nom_Liste : donne la liste des personnes qui ont souscrit &agrave; la liste;</li>
	<li> info Nom_Liste : renvoie le message d'introduction de la liste;</li>
	<li> lists : indique le nom des listes g&eacute;r&eacute;es par la machine;</li>
	<li> help : donne la liste des commandes;</li>
	<li> end : indique la fin de votre courrier (n'est utile que 
lorsque vous avez une  signature qui peut perturber <b>majordomo</b>.</li>
</ul>

      Prenons un exemple concret : la liste <b>echo-linux</b>. Pour y 
souscrire, il suffit de faire :
<pre>
mail majordomo@rd.lectra.fr
subscribe echo-linux zorglub@truc.glob.ici
</pre>

      Vous recevrez quelques instants plus tard un courrier &eacute;lectronique
avec le message d'introduction de la liste. Ensuite, une liste est quand 
m&ecirc;me faite pour y &eacute;crire. Dans ce cas, l'adresse electronique est 
normalement inscrite dans le message introductif : ce n'est pas la 
m&ecirc;me que celle pour souscrire !
<p>
	Les d&eacute;lais de r&eacute;ponses sont tr&egrave;s variables. Tout d&eacute;pend de la
charge de la machine (car majordomo &eacute;tant &eacute;crit en Perl, cela 
a tendance &agrave; charger un peu la machine), de sa puissance. Enfin,
la rapidit&eacute; d&eacute;pend &eacute;galement de la capacit&eacute; d'envoie du courrier 
&eacute;lectronique du site. Il faut savoir qu'une liste tr&egrave;s active et avec
beaucoup de personnes est tr&egrave;s consomatrice de ressources.

<a name=4>
<h1><IMG ALIGN=CENTER SRC="main.gif"> 4 - Cr&eacute;ation d'une liste</h1>
      
      Pour bien comprendre le m&eacute;canisme de cr&eacute;ation d'une nouvelle liste,
je vais prendre la cr&eacute;ation de la liste echo-linux. 

<a name=41>
<h2> 4.1 - Aliases</h2>

Dans un premier temps, il est n&eacute;cessaire d'&eacute;diter le fichier <tt>/etc/aliases</tt>
pour y rajouter la liste :
<pre>
# Liste echo-linux
echo-linux-outgoing: :include:/usr/local/mail/lists/echo-linux
echo-linux:"|/usr/local/mail/majordomo/wrapper resend -l echo-linux -h rd.lectra.fr -r echo-linux echo-linux-outgoing"
owner-echo-linux: dumas@rd.lectra.fr
echo-linux-request: "|/usr/local/mail/majordomo/wrapper request-answer echo-linux"
</pre>

      Pour &eacute;crire dans la liste, il suffit de faire 
<pre>
mail echo-linux@rd.lectra.fr
Subject: test

Ha que coucou !
</pre> 

      L'alias qui est le plus important est celui ayant pour nom 
<tt>echo-linux</tt>, car c'est &agrave; lui que l'on envoie les messages. Les options 
donn&eacute;es sp&eacute;cifient :
<ul>
	<li><tt> -l echo-linux</tt> : sp&eacute;cifie la liste ;</li>
	<li><tt> -h rd.lectra.fr</tt> : donne l'adresse de la machine &agrave; indiquer 
dans les ent&ecirc;tes de courrier &eacute;lectronique ;</li>
	<li><tt> -r echo-linux</tt> : sp&eacute;cifie le champ <tt>Reply-To</tt>.</li>
</ul>

<a name=42>
<h2> 4.2 - Configuration</h2>

Une fois les aliases correctement configur&eacute;, il est n&eacute;cessaire de cr&eacute;er la
liste au niveau de <b>majordomo</b>. Dans le r&eacute;pertoire 
<tt>/usr/local/mail/lists</tt>, il suffit de cr&eacute;er trois fichiers (Rq : nous 
sommes dans un cas simple) :
<ul>
	<li> echo-linux : ce fichier contient toutes les adresses &eacute;lectroniques 
des personnes ayant souscrit &agrave; la liste(il n'y a rien &agrave; faire) ;</li>
        <li> echo-linux.info : message introductif renvoy&eacute; lors de la soubscription
&agrave; la liste. Il s'agit d'un message au format texte ;</li>
	<li> echo-linux.config : fichier de configuration de la liste. Le plus 
simple &eacute;tant de prendre le fichier de configuration situ&eacute; dans le fichier
<tt>README</tt> de <b>majordom</b>. </li>
</ul>

      Ce fichier de configuration est particuli&egrave;rement bien
comment&eacute;, et ne sera pas comment&eacute; ici. Majordomo permet de g&eacute;rer
&eacute;galement des listes dites « mod&eacute;r&eacute;es ». Dans ce cas, le courrier
est tout d'abord envoy&eacute; au mod&eacute;rateur. Il est le seul habilit&eacute; &agrave;
envoyer un courrier dans la liste.


<a name=5>
<h1><IMG ALIGN=CENTER SRC="main.gif"> 5 - R&eacute;f&eacute;rences</h1>

      Cet article est une courte introduction &agrave; <b>majordomo</b>. 
Toutefois, cet outil est beaucoup plus puissant. Vous pouvez consultez
les documents suivants pour plus de renseignements :
<ul>
	<li>la FAQ concernant <b>majordomo</b>. Elle contient pas
mal de trucs et d'astuces qui peuvent &ecirc;tre tr&egrave;s utiles lors de
l'&eacute;tape de configuration.</li>
	<li> un petit r&eacute;sum&eacute; assez bien &eacute;crit par Tim Cramer : 
<a href="http://www.ups.edu/OIS/Fall95Dimensions/majordomo.html">http://www.ups.edu/OIS/Fall95Dimensions/majordomo.html</a></li>
	<li>un tr&egrave;s bon document d'introduction :
<a href="http://elm.bme.unc.edu:80/facilities/software/majordomo/">http://elm.bme.unc.edu:80/facilities/software/majordomo/</a></li>
	<li>une introduction &agrave; l'utilisation :
<a href="http://www.efn.org/services/majordom.html">http://www.efn.org/services/majordom.html</a></li>
</ul>
<hr>

</body>
</html>


