Repository: kaizenwa/Debian-1.3-Analysis
Catalog: debian-*-master/*/source/sound/mctools-lite-970129.orig/McTools/po/*.po
Languages: de

source: Synchronizing server...
de: Synchronisiere Serververbindung...

source: %s: No color named '%s', using default '%s'.
de: %s: Keine Farbe namens «%s», benutze Standardwert «%s».

source: %s: Ayieee, Can't allocate default color '%s',commiting suicide.
de: %s: Kreisch! Kann Standardfarbe «%s» nicht reservieren, begehe Selbstmord.

source: %s: Cannot allocate colormap entry for '%s'.
de: %s: Kann keinen Farbeintrag für «%s» reservieren.

source: %s: Can't open font '%s', using 'fixed'.
de: %s: Kann Font «%s» nicht laden, benutze «fixed».

source: %s: Can't open font 'fixed' either!
de: %s: Kann Font «fixed» auch nicht laden!

source: %s: X connection to %s broken, cleaning up.
de: %s: Verbindung zu %s verloren, räume auf.

source: Cancel
de: Abbruch

source: Rescan
de: Neu

source: Parent
de: Rauf

source: Open
de: Öffnen

source: Pattern:
de: Maske:

source: Path:
de: Pfad:

source: File:
de: Datei:

source: %s: warning: unknown directory format specifier.
de: %s: Warnung: Unbekannte Verzeichnisformatangabe.

source: So what?
de: Na und?

source: Doh!
de: Arrgh!

source: Oh no!
de: Oh nein!

source: Shut up!
de: Schnauze!

source: Never mind!
de: Vergiss es!

source: Oh really?
de: Echt?

source: Wheee...
de: Uff...

source: Very nice!
de: Sehr schön!

source: So?
de: Und?

source: Wow!
de: Boh!

source: Sure!
de: Sicher!

source: I don't care!
de: Egal!

source: not a directory
de: kein Verzeichnis

source: %s: Can't create state directory ~/%s: %s
de: %s: Kann Statusverzeichnis «%s» nicht anlegen: %s
