<HTML>
<TITLE>FvwmScript</TITLE>
<BODY>


<H1>FvwmScript</H1>

<P>
Article pour l'Echo de Linux (<em><b>Novembre 1996</b></em>) 
<address><a href="mailto:f-cord96@bat710.univ-lyon1.fr">Fr&eacute;d&eacute;ric CORDIER
(f-cord96@bat710.univ-lyon1.fr)</a></address> 

<P>
<H2>Sommaire</H2>
<UL>
<P><IMG ALIGN=BOTTOM SRC="ball.gif"><A HREF="#present"> Pr&eacute;sentation</A>
<P><IMG ALIGN=BOTTOM SRC="ball.gif"><A HREF="#install"> Installation</A>
<P><IMG ALIGN=BOTTOM SRC="ball.gif"><A HREF="#utilise"> Utilisation</A>
<P><IMG ALIGN=BOTTOM SRC="ball.gif"><A HREF="#extensi"> Extension</A>
<P><IMG ALIGN=BOTTOM SRC="ball.gif"><A HREF="#telecha"> T&eacute;l&eacute;chargement</A>
</UL>
<BR>
<BR>
<HR>
<H2><A NAME="present">Pr&eacute;sentation de FvwmScript</A></H2>FvwmScript est un module du 
gestionnaire de fen&ecirc;tre Fvwm. Il permet &agrave; l'aide d'un script de construire
une application graphique &agrave; partir d'objets (widget
en anglais). Ce module est utilis&eacute; pour ajouter une interface graphique &agrave; des programmes 
fonctionnant en mode texte. Avec FvwmScript, il est possible de construire diff&eacute;rents 
accessoires de bureau, par exemple:
<UL>
<P><IMG ALIGN=BOTTOM SRC="ball.gif">Un accessoire de bureau pour contr&ocirc;ler les propri&eacute;t&eacute;s
de l'&eacute;cran. Cette accessoire utilise les programmes <I>xset</I> et <I>xsetroot</I>.<BR>
<IMG ALIGN=CENTER SRC="sphoto2.gif"><BR><BR>
<P><IMG ALIGN=BOTTOM SRC="ball.gif">Une boite de dialogue pour confirmer la fin d'une
session ou red&eacute;marrer la machine.<BR>
<IMG ALIGN=BOTTOM SRC="sphoto4.gif"><BR><BR>
<P><IMG ALIGN=BOTTOM SRC="ball.gif">Un accessoire de bureau pour r&eacute;gler la date et l'heure.
Cette accessoire utilise le programme <I>date</I>.<BR>
<IMG ALIGN=BOTTOM SRC="sphoto3.gif"><BR><BR>
<P><IMG ALIGN=BOTTOM SRC="ball.gif">Une barre qui pr&eacute;sente les m&ecirc;me fonctionnalit&eacute;s que 
FvwmButton. Ce script sert a lancer des programmes, afficher l'heure avec <I>xclock</I>,
la charge systeme avec <I>xload</I>...<BR>
<IMG ALIGN=BOTTOM SRC="sphoto1.gif">
</UL>
<BR>
<HR>

<H2><A NAME="install">Installation de FvwmScript</A></H2> L'installation de FvwmScript
est relativement simple. Il faut d'abord se procurer les sources compl&egrave;tes de Fvwm.
Apres avoir configur&eacute; et compil&eacute; Fvwm, il faut installer les sources de FvwmScript 
dans le r&eacute;pertoire <I>/fvwm-2.xx/modules/</I> contenant les modules. Pour la compilation et
l'installation, il suffit de taper dans le r&eacute;pertoire de FvwmScript les commandes suivantes:
<UL>
<P><I>xmkmf</I>
<P><I>make</I>
<P><I>make install</I>
<P><I>make install.man</I>
</UL>
Le module doit maintenant se trouver avec les autres modules compil&eacute;s dans le r&eacute;pertoire 
<I>/usr/X11/lib/X11/fvwm/</I>
<BR>
<BR>
<HR>

<H2><A NAME="utilise">Utilisation de FvwmScript</A></H2> FvwmScript comme tous les autres 
modules se lance a partir du fichier de configuration de Fvwm. FvwmScript prend comme argument
l'emplacement et le nom du script &agrave; ex&eacute;cuter. Le script
se trouve toujours dans un fichier s&eacute;par&eacute;. La syntaxe est la suivante:<BR>
<UL>
<I>Module FvwmScript nom_du_script</I><BR>
</UL>
<BR>
FvwmScript utilise une langage semblable a Tcl-Tk. Il permet de manipuler des variables, des
boucles conditionnelles, de lancer des applications et de lire leur sortie standard, d'&eacute;crire 
dans un fichier. Le langage comporte en plus un certain nombre de commandes permettant
de modifier dynamiquement l'apparence des objets comme la taille, la couleur, la position
, la police...<BR>
<BR>
Au d&eacute;marrage, FvwmScript analyse le fichier
pass&eacute; en param&egrave;tre. Si une erreur de syntaxe est d&eacute;tect&eacute;, le module indique le num&eacute;ro de la 
ligne contenant l'erreur sur la sortie standard et s'arr&ecirc;te. Si l'analyse s'est faite sans probl&ecirc;me,
FvwmScript affiche une fen&ecirc;tre avec les objets d&eacute;finis dans le script. Ensuite, en fonction 
de l'intervention de l'utilisateur sur les objets, les commandes pr&eacute;vus dans le script sont
ex&eacute;cut&eacute;s.<BR>
<BR>
Les pages man contiennent une description d&eacute;taill&eacute;e sur la syntaxe de ce langage. Les sources
de FvwmScript contiennent aussi sept exemples de scripts et un fichier de configuration de Fvwm
utilisant ces exemples. 
<BR>
<BR>
<HR>

<H2><A NAME="extensi">Extension de FvwmScript</A></H2> Il est possible d'ajouter ses propres
widgets &agrave; FvwmScript. Le r&eacute;pertoire <I>/FvwmScript/widgets/</I> contient les sources des
differents objets. Pour ajouter un nouvel objet, il suffit de cr&eacute;er un objet respectant 
l'interface avec le module. Cette interface comprend une fonction d'initialisation de
l'objet, plusieurs fonctions pour traiter les &eacute;v&eacute;nements du serveur X et une fonction de 
destruction de l'objet. Le fichier <I>widget.c</I> doit &ecirc;tre mis a jour afin que l'objet
soit prise en compte.<BR>
<BR>
<BR>
<HR>
<H2><A NAME="telecha">T&eacute;l&eacute;charger FvwmScript</A></H2> FvwmScript est enti&egrave;rement gratuit.
Ses sources sont librement diffusable selon les termes GNU. FvwmScript est disponible 
<A HREF="http://bat710.univ-lyon1.fr/~f-cord96/fvwmscrp.tgz">ici</A>.
Des informations compl&eacute;mentaires sur Fvwm et les autres modules sont disponibles sur le 
<A HREF="http://www.hpc.uh.edu/fvwm">serveur de Fvwm</A>.
<BR>
<BR>
<HR>
<ADDRESS>
Written by <A HREF="http://www710.univ-lyon1.fr/~f-cord96">Fr&eacute;d&eacute;ric CORDIER</A> &lt;f-cord96@bat710.univ-lyon1.fr&gt;<BR>
Last updated Nov 12 19:39:26 GMT 1996
</ADDRESS>
</BODY>
</HTML>

