<!-- 
	install-java.html 
	Installation et utilisation de Java sur Linux 
	Frederic Couchet (mad@bocal.cs.univ-paris8.fr)

	Article destine a l'Echo de Linux.

-->

<HTML>
<HEAD>
<TITLE>Java et Linux</TITLE>
</HEAD>
<BODY>
<IMG SRC="hotjava.gif" ALIGN=left HSPACE=10>
<H1>Utilisation de Java sur Linux</H1>

<BR>Article pour l'Echo de LINUX (<B><I>Ao&ucirc;t 1996</B></I>)
<BR>Fr&eacute;d&eacute;ric Couchet <CODE>
(<A HREF="mailto:mad@bocal.cs.univ-paris8.fr">mad@bocal.cs.univ-paris8.fr</A>)
</CODE>
<BR CLEAR=left>
<P>
<HR><EM>Cet article explique comment installer et utiliser le Java
Developer's Kit (JDK) sur un syst&egrave;me Linux. 
<BR>Le portage du JDK
sur Linux a &eacute;t&eacute; effectu&eacute; par Randy Chapman (chapman@u.washington.edu). </EM>
<HR>

<H2>1. <A HREF="#toc1">Introduction</A></H2>
<H2>2. <A HREF="#toc2">Installation de Java</A></H2>
<UL>
<LI><A HREF="#toc3">2.1 Slackware</A>
<LI><A HREF="#toc4">2.2 Red Hat 2.1</A>
<LI><A HREF="#toc10">2.3 Red Hat 3.0</A>
</UL>
<H2>3. <A HREF="#toc5">Voir les d&eacute;mos</A></H2>
<H2>4. <A HREF="#toc6">Faire un programme Java</A></H2>
<H2>5. <A HREF="#toc7">Faire une applet Java</A></H2>
<H2>6. <A HREF="#toc8">Java et noyau 2.0.0</A></H2>
<H2>7. <A HREF="#toc9">R&eacute;f&eacute;rences</A></H2>

<HR>

<H2>1. <A NAME="toc1">Introduction</A></H2>

<P>Java est un langage orient&eacute; objet d&eacute;velopp&eacute; par Sun Microsystems. Les programmes Java sont soit des applications, soit 
des applets. Les <EM>applications</EM> sont des programmes autonomes (par exemple HotJava, le navigateur de Sun).
Les <EM>applets</EM> sont similaires aux applications mais elles sont ex&eacute;cut&eacute;es par un navigateur compatible Java (par 
exemple Netscape, HotJava).</P>

<P>Le JDK contient principalement les librairies de classes standard (<EM>java.lang,
java.util, java.io, java.net, java.awt, java.applet</EM>) avec leurs sources, le compilateur
(<EM>javac</EM>), l'interpr&eacute;teur (<EM>java</EM>) permettant d'ex&eacute;cuter des applications,
un interpr&eacute;teur d'applets (<EM>appletviewer</EM>), un g&eacute;n&eacute;rateur de
documentation (<EM>javadoc</EM>), un g&eacute;n&eacute;rateur de fichiers header C (pour
l'int&eacute;gration du code C dans le code Java), et un debugger.</P>
<HR>


<H2>2. <A NAME="toc2"></A>Installation de Java</H2>

<P>Dans un premier temps r&eacute;cup&eacute;rez le JDK pour Linux sur l'un des sites suivants (liste non exhaustive):
<UL>
<LI>
<A HREF="ftp://ftp.u-bordeaux.fr/pub/Linux/Java">ftp://ftp.u-bordeaux.fr/pub/Linux/Java</A> (r&eacute;pertoire JDK-1.0.1)
 </LI>
<LI>
<A HREF="ftp://ftp.ese-metz.fr/pub3/Linux/Apps/java">ftp://ftp.ese_metz.fr/pub/Linux/Apps/java</A>
 </LI>
<LI>
<A HREF="ftp://ftp.linux.org.uk/pub/linux/java">ftp://ftp.linux.org.uk/pub/linux/java</A>
 </LI>
</UL>
</P>
<P>Vous avez besoin des fichiers suivants:
<UL>
<LI>linux.jdk-1.0.1-try1.common.tar.gz </LI>
<LI>et soit linux.jdk-1.0.1-try3.shared-motif.tar.gz (si vous avez les
librairies partag&eacute;es Motif 2.0 sur votre syst&egrave;me)</LI>
<LI>soit linux.jdk-1.0.1-try3.static-motif.tar.gz (dans le cas contraire)</LI>
</UL>
</P>
<P>Pour installer le JDK (de pr&eacute;f&eacute;rence dans le r&eacute;pertoire /usr/local), ex&eacute;cutez les commandes suivantes:
<PRE>
droopy# cd /usr/local
droopy# tar zxvf linux.jdk-1.0.1-try1.common.tar.gz 
et soit:
droopy# tar zxvf linux.jdk-1.0.1-try3.shared-motif.tar.gz 
soit:
droopy# tar zxvf linux.jdk-1.0.1-try3.static-motif.tar.gz 
</PRE>
</P>
<P>Les diff&eacute;rents binaires de java (compilateur, previewer ...) se trouvent alors dans le r&eacute;pertoire
<EM>/usr/local/java/bin</EM>. Ajoutez ce repertoire dans votre PATH
(en bash):
<PRE>
export PATH=${PATH}:/usr/local/java/bin
</PRE>
</P>
<P>Installez un navigateur Web compatible Java, par exemple Netscape (les versions de Netscape &agrave; partir de la
2.0b3 sont compatibles Java). Vous pouvez, par exemple, r&eacute;cup&eacute;rez netscape sur 
<A HREF="ftp://ftp.ibp.fr/pub/www/netscape/navigator">ftp://ftp.ibp.fr/pub/www/netscape/navigator</A>.
L'installation est tr&egrave;s
simple:
<PRE>
droopy# cd /usr/local
droopy# mkdir netscape
droopy# cd netscape
droopy# tar xzvf netscape-v20-export.i486-unknown-linux.tar.gz
</PRE>
</P>
<P>Pour utiliser le JDK vous devez disposer d'un syst&egrave;me ELF bas&eacute; sur un
noyau 1.2.13 ou ult&eacute;rieur. De plus, vous devez disposer des librairies suivantes :
<PRE>
libc.5 = /lib/libc.so.5.2.18 (librairie C standard)
libX11.so.6 = /usr/X11/lib/libX11.so.6.0 (librairie X11R6)
libXt.so.6 = /usr/X11/lib/libXt.so.6.0 (librairie Athena)
libXext.so.6 = /usr/X11/lib/libXext.so.6.0 (librairie extensions X)
libXpm.so.4 = /usr/X11/lib/libXpm.so.4.3 (librairie pixmap)
libdl.so.1 = /lib/libdl.so.1.7.11 (loader dynamique Linux)
</PRE>

V&eacute;rifiez que ces librairies sont install&eacute;es sur votre syst&egrave;me (les versions des
librairies sont les versions minimales pour faire fonctionner Java). Si vous ne disposez pas de l'ensemble de ces librairies, installez celles qui
manquent. </P>
<P>Les mises &agrave; jour d&eacute;pendent de la distribution que vous utilisez. Je
vais passer en revue le cas de la Slackware et de la Red Hat qui
semblent les deux distributions les plus utilis&eacute;es.</P>
<P></P>
<H3>2.1 <A NAME="toc3"> Slackware</A></H3>

<P>Avec la distribution Slackware 3.0 ELF kernel 1.2.13 vous devez mettre &agrave;
jour la librairie C et le loader (les versions fournies avec la distribution sont des versions
ant&eacute;rieures).</P>
<P>Pour installer la librairie C, r&eacute;cup&eacute;rez les fichiers libc-5.2.18.bin.tar.gz et release.libc-5.2.18 sur
le site ftp suivant: 
<A HREF="ftp://ftp.ibp.fr/pub/linux/GCC">ftp://ftp.ibp.fr/pub/linux/GCC</A>
. Le fichier
release.libc-5.2.18 contient les instructions
d'installation. 
<BR>
Pour le loader, r&eacute;cup&eacute;rez le fichier ld.so.1.7.14.tar.gz sur le site ftp suivant: 
<A HREF="ftp://ftp.ibp.fr/pub/linux/GCC">ftp://ftp.ibp.fr/pub/linux/GCC</A>
. Ex&eacute;cutez les commandes suivantes:
<PRE>
droopy# tar xzvf ld.so.1.7.14.tar.gz
droopy# cd ld.so.1.7.14
droopy# ./instldso.sh
</PRE>
Une fois les librairies install&eacute;es, mise &agrave; jour des librairies:
<PRE>
droopy# ldconfig
</PRE>
</P>
<P></P>

<H3>2.2 <A NAME="toc4"> Red Hat 2.1</A></H3>

<P>Avec la distribution Red Hat 2.1 ELF kernel 1.2.13 vous devez
&eacute;galement mettre &agrave; jour la librairie C et le loader. Pour la mise &agrave; jour r&eacute;cup&eacute;rez les
fichiers rpm correspondants sur un mirroir Red Hat, et utiliser la
commande <B>rpm</B> pour les installer. En outre vous devez faire un
<B>chmod 666 /dev/zero</B> si vous voulez utiliser java autrement
que sous root (ceci concerne principalement l'appletviewer).</P>

<H3>2.3 <A NAME="toc10"> Red Hat 3.0</A></H3>
<P>Avec la distribution RedHat 3.0 aucune mise &agrave; jour n'est
n&eacute;cessaire. Par contre, vous devez tout de m&ecirc;me faire un <B>chmod 666 /dev/zero</B>.</P>
<P></P>

<HR>


<H2>3. <A NAME="toc5">Voir les d&eacute;mos</A></H2>

<P>Sous netscape ouvrez le r&eacute;pertoire /usr/local/java/demo. Quelques d&eacute;mos
faites avec java s'y trouvent. Dans les sous-r&eacute;pertoire, pour lancer les applets ouvrez les
divers fichiers HTML. 
</P>
<HR>

<H2>4. <A NAME="toc6">Faire un programme Java</A></H2>

<P>Nous allons dans un premier temps cr&eacute;er, compiler et ex&eacute;cuter un programme Java. </P>
<P>Pour notre premier programme Java, nous allons faire le traditionnel
programme "Hello World". Cr&eacute;ons le fichier <b>hello.java</b> (qui contient le
code source java) dont le contenu est le suivant:</P>
<P>
<HR>
<PRE>
import java.io.*;

class HelloWorldApp {
        public static void main(String args[]){
                System.out.println(&quot;Hello World ! &quot;);
        }
}
</PRE>
<HR>
</P>
<P>La compilation de notre programme s'effectue gr&acirc;ce &agrave; la commande <B>javac</B> avec le nom du fichier source comme argument:
<PRE>
droopy# javac hello.java
</PRE>

Cette commande cr&eacute;e un fichier semi-compil&eacute; qui porte le m&ecirc;me nom que la classe qu'il d&eacute;crit, suffix&eacute; par <B>.class</B>: dans notre exemple on obtient le fichier <B>HelloWorldApp.class</B>.</P>
<P>Pour ex&eacute;cuter le programme on utilise la commande <B>java</B> de la fa&ccedil;on suivante:
<PRE>
droopy# java HelloWorldApp
</PRE>

Vous noterez que l'argument de l'interpr&eacute;teur Java est le nom de la
classe d&eacute;finie, et non pas le nom du fichier.</P>
<P></P>
<HR>
<H2>5. <A NAME="toc7">Faire une applet Java</A></H2>

<P>Une applet Java est une application qui est charg&eacute;e par votre navigateur (Netscape, HotJava), &agrave; travers le r&eacute;seau, et qui ne r&eacute;side donc pas sur le disque dur de la machine qui l'ex&eacute;cute.</P>
<P>Une applet est appel&eacute;e &agrave; partir d'un fichier source HTML. Par exemple cr&eacute;ez le fichier <B>applet.html</B> dont le contenu est le suivant:
</P>
<HR>
&lt;TITLE>Applet Java &lt;/TITLE&gt;
<BR>
&lt;H1&gt;Applet Hello World&lt;/H1&gt;
<BR>
&lt;APPLET CODE=&quot;HelloWorld.class&quot; WIDTH=150 HEIGHT=50&gt;
<BR>
&lt;/APPLET&gt;
<HR>
<P>On voit apparaitre une nouvelle balise HTML: <B>APPLET</B>. L'option <B>CODE</B> donne le nom de la classe qu'il faut charger. Le navigateur va chercher cette classe dans le r&eacute;pertoire o&ugrave; il a trouv&eacute; la page HTML.</P>
<P>Le code du source Java est le suivant (fichier <b>hello-world.java</b>):
</P>
<HR>
<PRE>
import java.awt.Graphics;
import java.applet.*;

public class HelloWorld extends Applet  {
  public void init() {
                resize(150,25);
        }

  public void paint(Graphics g){
                g.drawString(&quot;Hello World ! &quot;,50,25);
        }
}
</PRE>
<HR>
<P>Vous compilez votre source java comme vu pr&eacute;c&eacute;demment.</P>
<P>Pour ex&eacute;cuter votre applet, lancez netscape et ouvrez le fichier: <B>applet.html</b>. Dans la fen&ecirc;tre netscape un message "Hello World !"va s'afficher.</P>
<P>Vous pouvez &eacute;galement visualiser le r&eacute;sultat de votre applet sans
navigateur. Vous devez utiliser pour cela l'<EM>appletviewer</EM> (situ&eacute;
dans le m&ecirc;me r&eacute;pertoire que le compilateur java). :
<PRE>
droopy# appletviewer HelloWorld
</PRE>
</P>

<H2>6. <A NAME="toc8">Java et noyau 2.0.0</A></H2>

<P>Pour les heureux possesseurs de la version 2.0.0 du noyau Linux il est possible d'int&eacute;grer le support des binaires Java dans le noyau. Les &eacute;tapes n&eacute;cessaires sont d&eacute;crites dans les sources du noyau (fichier Documentation/java.txt).</P>
<P>Vous devez dans un premier temps compiler votre noyau avec le support Java. Au niveau de la configuration du noyau par la commande <B> make config</B>
<PRE>
*
* Code maturity level options
*
Prompt for development and/or incomplete code/drivers (CONFIG_EXPERIMENTAL) [N/y/?] (NEW)
</PRE>

A ce point vous devez r&eacute;pondre <B>y</B>.
<PRE>
Kernel support for JAVA binaries (CONFIG_BINFMT_JAVA) [N/y/m/?] (NEW) y
</PRE>

Vous r&eacute;pondez <B>y</B>.</P>
<P>Vous compilez votre noyau: <B>make dep; make clean; make zImage</B>.</P>
<P>Vous devez ensuite dire au noyau o&ugrave; se trouve l'interpr&eacute;teur et l'appletviewer JAVA. Il y a deux fa&ccedil;ons de faire ceci. La premi&egrave;re est d'&eacute;diter le fichier <B>fs/binfmt_java.c</B> (dans les sources du noyau) et de modifier les d&eacute;finitions de _PATH_JAVA et de _PATH_APPLET (vous recompilez ensuite le noyau). La deuxi&egrave;me m&eacute;thode est, en &eacute;tant root, de lancer la commande (on suppose que les binaires de l'interpr&eacute;teur et de l'appletviewer sont dans /usr/local/java/bin/):
<PRE>
droopy# cat /usr/local/java/bin/java &gt; /proc/sys/kernel/java-interpreter
droopy# cat /usr/local/java/bin/appletviewer &gt; /proc/sys/kernel/java-appletviewer
</PRE>

Cette deuxi&egrave;me m&eacute;thode ne fonctionne pas si vous avez d&eacute;clarer le support Java en module.</P>
<P>Vous rendez ex&eacute;cutable vos fichier '*.class', par exemple:
<PRE>
droopy# chmod +x HelloWorldApp.class
</PRE>
</P>
<P>Et vous pouvez l'ex&eacute;cuter directement:
<PRE>
droopy# ./HelloWorldApp.class
</PRE>
</P>
<P>Vous pouvez faire de m&ecirc;me avec vos applets. Pour cela vous ins&eacute;rez une nouvelle premi&egrave;re ligne dans le fichier source HTML:
<PRE>
&lt;!--applet--&gt;
</PRE>
</P>
<P>Vous rendez ex&eacute;cutable le fichier '.html', par exemple:
<PRE>
droopy# chmod +x applet.html
</PRE>
</P>
<P>Et vous pouvez l'ex&eacute;cuter directement:
<PRE>
droopy# ./applet.html
</PRE>
</P>


<H2>7. <A NAME="toc9"></A>R&eacute;f&eacute;rences</H2>

<P></P>
<P>L'objet de cet article n'&eacute;tant pas de d&eacute;crire le langage Java en d&eacute;tail je vous conseille les quelques r&eacute;f&eacute;rences 
suivantes:
<UL>
<LI>Le Java on Linux HOWTO de Eric S. Raymond que vous pouvez trouver sur <CODE><A HREF="ftp://ftp.ibp.fr/pub/linux/tsx-11/docs/HOWTO">ftp://ftp.ibp.fr/pub/linux/tsx-11/docs/HOWTO</A></CODE></LI>
<LI><CODE> 
<A HREF="http://www.labri.u-bordeaux.fr/java">http://www.labri.u-bordeaux.fr/java</A>
</CODE></LI>
<LI><CODE>
<A HREF="http://pausejava.u-strasbg.fr">http://pausejava.u-strasbg.fr</A>
</CODE></LI>
<LI><CODE>
<A HREF="http://www.gamelan.com">http://www.gamelan.com</A>
</CODE></LI>
<LI><CODE>
<A HREF="http://www.javasoft.com">http://www.javasoft.com</A>
</CODE></LI>
<LI><CODE>
<A HREF="http://www.blackdown.org">http://www.blackdown.org</A>
</CODE></LI>
<LI><CODE>
<A HREF="news://fr.comp.lang.java">news://fr.comp.lang.java</A>
</CODE></LI>
</UL>
</P>

</BODY>
</HTML>
