Repository: kaizenwa/Debian-1.3-Analysis
Catalog: debian-*-master/*/source/sound/mctools-lite-970129.orig/XPlaycd/po/*.xmdb.po
Languages: de

source: %s: Too many arguments
de: %s: Zu viele Parameter

source: cddb resource is not set. Using current directory.
de: *cddb Resource nicht gesetzt. Benutze aktuelles Verzeichnis.

source: Usage: %s
de: Anwendung: %s

source: Cannot read directory '%s/%s' Reason: %s
de: Kann Verzeichnis «%s/%s» nicht lesen. Grund: %s

source: Invalid path for update: `%s'
de: Ungültiger Pfad zum Aktualisieren: «%s»

source: Ooops! There is already a file for this media in the destination cathegory. You should clean up that mess in your database!
de: Huch??!? Eine Datei für diese CD existiert bereits in der Zielkategorie. Sie sollten mal Ihre Datenbank aufräumen...

source: Couldn't rename "%s" into "%s" Reason:%s
de: Fehler beim Umbenennen von «%s» in «%s» Grund: %s

source: Unable to create "%s" Reason: %s
de: Fehler beim Anlegen von «%s» Grund: %s

source: Edit
de: Bearbeiten

source: Move
de: Verschieben

source: New
de: Neu

source: Delete
de: Löschen

source: Exit
de: Ende

source: You are going to delete %s Are you sure?
de: Löschen von %s Sicher?

source: Yes
de: Klar doch

source: No
de: Niemals!

source: Failed to delete `%s' Reason: %s
de: Kann «%s» nicht löschen Grund: %s

source: Apply
de: Übernehmen

source: Undo
de: Rückgängig

source: Cancel
de: Abbruch

source: Title:
de: Titel:

source: Can't open database file `%s' Reason: %s
de: Fehler beim öffnen der Datenbankdatei «%s» Grund: %s

source: Huh? No path for database file?
de: Huch? Keinen Pfad für Datenbankdatei?

source: Error reading database file into buffer. Reason: %s
de: Fehler beim Lesen der Datenbankdatei. Grund: %s

source: Unable to write database file `%s' Reason: %s
de: Fehler beim Schreiben der Datenbankdatei «%s». Reason: %s

source: You can't save a Media with no title.
de: Sie können keine CD ohne Titel abspeichern.

source: New Media
de: Neue CD

source: Please select cathegory for
de: Bitte wählen Sie eine Kategorie für

source: Save
de: Speichern

source: Move Media
de: Verschieben

source: Please select new cathegory for
de: Bitte wählen Sie eine neue Kategorie für

source: New Cathegory
de: Neue Kategorie

source: Please enter name of new cathegory
de: Bitte geben Sie den Namen der neuen Kategorie ein

source: Create
de: Ok
