Repository: kaizenwa/Debian-1.3-Analysis
Catalog: debian-*-master/*/source/sound/mctools-lite-970129.orig/XPlaycd/po/*.xplaycd.po
Languages: de

source: Disabled
de: Inaktiv

source: Data
de: Daten

source: Stopped
de: Stop

source: No disk
de: Keine CD

source: Error
de: Fehler

source: Mode %d
de: Modus %d

source: Track: %s%02d:%02d
de: Titel: %s%02d:%02d

source: Disc: %02d:%02d
de: CD: %02d:%02d

source: Start mark
de: Startmarke

source: End mark
de: Stopmarke

source: %s: Confused, no start mark.
de: %s: Verwirrt, keine Startmarke.

source: %s: Confused, no stop mark.
de: %s: Verwirrt, keine Stopmarke.

source: Error: Neither *cddb nor *systemCddb resource is set. The cd database won't work and you will get this nasty message until you set up a proper resource...
de: Fehler: Weder die *cddb noch *systemCddb Resource ist gesetzt. Die CD Datenbank wird nicht funktionieren und Sie werden diese lästige Meldung immer wieder sehen bis eine der Resourcen gesetzt ist...

source: Can't create directory '%s' Reason: %s
de: Fehler beim Anlegen des Verzeichnisses «%s» Grund: %s

source: Can't create directory '%s' Reason: File exists
de: Fehler beim Anlegen des Verzeichnisses «%s» Grund: Datei existiert bereits

source: I don't know where to safe your stuff, since the xplaycd*cddb resource is not set. I'm confused. I won't save anything.
de: Ich weiß nicht wo ich die Daten hinspeichern soll solange die *cddb Resource nicht gesetzt ist. Speichere nichts!

source: Failed to write to file '%s' Reason: %s
de: Fehler beim Schreiben in «%s» Grund: %s

source: Couldn't open %s: %s
de: Fehler beim Öffnen von «%s»: %s

source: DATA TRACK
de: Datenspur

source: %s: can't open %s: %s
de: %s: Fehler beim Öffnen von «%s»: %s

source: %s: failed to read mixer capabilities.
de: %s: Fehler beim lesen der Mischereigenschaften.

source: %s: mixer id `%s' not supported by your system.
de: %s: Mischer «%s» wird vom System nicht unterstützt.

source: %s: Too many arguments
de: %s: Zu viele Parameter

source: Can't fork media editor. Reason: %s
de: Fehler beim Starten des Media-Editors Grund: %s

source: Main Menu
de: Hauptmenü

source: Reload
de: Aktualisieren

source: Diskinfo
de: CD Info

source: Trackinfo
de: Titelinfo

source: Memory usage
de: Speicherverbrauch

source: %s: Poll rate too low, using 1/3s.
de: %s: Abtastrate zu niedrig, benutze 1/3s.

source: %s: Mixer id `%s' not supported. Supported ids are:
de: %s: Mischer «%s» nicht unterstützt. Folgende Namen sind zulässig:

source: %s: Can't open %s:
de: %s: Fehler beim Öffnen von «%s»:

source: Guess what?
de: Drück mich!

source: Load/Eject
de: Schublade

source: Search backward
de: Rückwärts suchen

source: Play/Stop
de: Start/Stop

source: Search forward
de: Vorwärts suchen

source: Shuffle tracks
de: Zufallsauswahl

source: Repeat mode
de: Wiederholen

source: Previous track
de: Letzter Titel

source: Next track
de: Nächster Titel
