<HEAD>
   <meta name="Author"    value="David Cure <cure@cnam.fr>">
   <meta name="GENERATOR" value="Everest 3.5E + dc_html.krz">
   <TITLE>Linux/68k</TITLE>
</HEAD>

<BODY>

<IMG SRC="linux.gif" ALIGN=left HSPACE=10> 
<H1> 
<P>Linux/68k
</H1>
<P>
Article pour l'Echo de Linux (<em><b>Juillet 1996</b></em>) 
<address><a href="mailto:cure@cnam.fr">David Cure
(cure@cnam.fr)</a></address> 

<BR CLEAR=left>
<HR>


<p> </p>
<p>
Voici le premier article (d'une longue s&eacute;rie j'esp&egrave;re) sur Linux/68k,
la version de Linux pour les processeurs de la s&eacute;rie 680x0 de 
Motorola.</p>
<p>
Voici ce que vous allez pouvoir d&eacute;couvrir dans cette article :<br>
<ul>
   <li> <A HREF="#present">Une petite pr&eacute;sentation</A>
   <li> <A HREF="#matos">Le mat&eacute;riel n&eacute;cessaire</A>
   <li> <A HREF="#soft">Les packages disponibles</A>
   <li> <A HREF="#news">Les nouveaut&eacute;s</A>
</ul>
</p>

<hr>
<p> </p>
<A NAME="present"><H2 align="center">Pr&eacute;sentation</H2></A>
<p>
Et on commence tout de suite par une petite pr&eacute;sentation du portage
de Linux en version 68k.</p>
<p>
Le d&eacute;marrage de ce portage a commenc&eacute; en Allemagne &agrave; partir de la 
version 1.0 de Linux/Intel et a donn&eacute; naissance &agrave; la premi&egrave;re 
version de Linux/68k, la s&eacute;rie des 0.8.x.<br>
Ces premi&egrave;res versions fonctionnaient uniquement sur Atari et 
Amiga dans des configurations bien pr&eacute;cises.</p>
<p>
La s&eacute;rie suivante (0.9.x) prend en compte beaucoup plus de 
configurations mais toujours dans le monde Atari/Amiga.</p>
<p>
Une adaptation de cette version pour Macintosh avait commenc&eacute;e, mais
elle a &eacute;t&eacute; abandonn&eacute;e. Si vous voulez une version Macintosh,
tournez vous vers <A HREF="http://www.mklinux.apple.com">MkLinux.</A>
</p>

<hr>
<p> </p>
<h3 align="center">Mais qu'apporte Linux ?</h3>
<p>
Question bien l&eacute;gitime quand on poss&eacute;de d&eacute;j&agrave; un syst&egrave;me d'exploitation
en avance de 10 ans sur sa machine :-).</p>
<p>
Linux permet d'avoir un syst&egrave;me d'exploitation multit&acirc;ches, 
c'est-a-dire, pouvant faire fonctionner en m&ecirc;me temps plusieurs 
programmes &agrave; la fois.<br>
Il permet d'&ecirc;tre compatible avec un tr&egrave;s grands nombres de programmes
disponible en version source pour les diff&eacute;rents Unix, tr&egrave;s
pratique, car on peut trouver sur l'Internet de nombreux programmes
allant de l'&eacute;diteur de textes aux compilateurs.<br>
Dans le syst&egrave;me, le protocole r&eacute;seau TCP/IP est en standard, &agrave; 
l'heure o&ugrave; l'Internet est sur toutes les l&egrave;vres, c'est indispensable.<br>
Si vous voulez en savoir plus sur Linux, allez faire un tour sur
le site de <A HREF="http://www.freenix.fr">Freenix</A>, le groupe
d'utilisateur fran&ccedil;ais d'Unix gratuits.</p>
 
<hr>
<p> </p>
<A NAME="matos"><h2 align="center">Le mat&eacute;riel n&eacute;cessaire</h2></A>
<p>
Je vous ai donn&eacute; envie d'installer Linux/68k ? Si oui, il faut
quand m&ecirc;me regarder si votre mat&eacute;riel et vos p&eacute;riph&eacute;riques sont
pris en compte.</p>
<p>
Que ce soit sur Atari ou Amiga, il faut avoir au minimum un
processeur avec une MMU (processeur de gestion de la m&eacute;moire),
c'est-&agrave;-dire, au minimum un 68030.<br>
Le processeur 060 n'est pas pour le moment support&eacute;.</p>
<p>
Il faut aussi un co-processeur arithm&eacute;tique : 68881 ou 68882.</p>
<p>
An niveau de la m&eacute;moire vive, un minimum de 4 Mo est conseill&eacute;.<br>
Et si vous voulez utiliser X11 (l'interface graphique), il faut 
un minimum de 8 Mo.</p>
<p>
Les p&eacute;riph&eacute;riques IDE et SCSI sont support&eacute;s (il reste encore
quelques probl&egrave;mes avec certains CD IDE).</p>
<p>
Pour le monde Atari, cela correspond aux machines TT030 et Falcon030,
pour l'Amiga, aux Amiga 1200, 2000, 3000 et 4000.</p>

<hr>
<p> </p>
<A NAME="soft"><h2 align="center">Les packages n&eacute;cessaires</h2></A>
<p>
Vous &ecirc;tes l'heureux possesseur d'une machine list&eacute;e ci-dessus ?</p>
<p>
Et bien maintenant, il vous faut quelques fichiers pour installer
Linux/68k.</p>
<p>
Le site de r&eacute;ference pour Linux/68k est 
<A HREF="ftp://ftp.uni-erlangen.de/pub/Linux/LOCAL/680x0/">ftp.uni-erlangen.de</A>.<br>
Malheureusement, ce site n'est pas tr&egrave;s rapide.<br>
Un mirror de ce site existe : <A HREF="ftp://tsx-11.mit.edu/pub/linux/680x0">tsx-11</A>,
lui m&ecirc;me mirroris&eacute; en france sur le site incontournable qu'est
<A HREF="ftp://ftp.ibp.fr/pub/linux/tsx-11/680x0">l'IBP</A>.<br>
Un autre site fran&ccedil;ais existe : le <A HREF="http://www.cnam.fr/Comp/Atari/Index_Linux68k.html">CNAM</A>,
avec plus pr&eacute;cisement, des versions pour Atari (ce site est en cours de
r&eacute;vision, alors un peu d'indulgence :-) ).</p>
<p>
Pour l'installation des guides existent ici et l&agrave;, en voici un petit
r&eacute;sum&eacute; :<br>
<ul>
   <li> <A HREF="http://www.cnam.fr/Comp/Atari/Saga/linux_os.htm">Installation sur Atari</A>, en fran&ccedil;ais,
   <li> <A HREF="http://www.informatik.uni-oldenburg.de/~amigo/inst.html">Installation sur Amiga</A>,
	en anglais,
</ul>
<br>
Bien que ces guides soient plus orient&eacute;s pour une machine sp&eacute;cifique,
l'un comme l'autre peut &ecirc;tre utile pour l'autre machine. 
</p>
<p>
Des documents disponibles en fran&ccedil;ais existent pour Linux/Intel,
ne les n&eacute;gligez pas, car ils peuvent rendrent de nombreux services,
notement le Guide du ROOTard, et les diff&eacute;rents HOW-TO.</p>

<hr>
<p> </p>
<A NAME="news"><h2 align="center">Les nouveaut&eacute;s</h2></A>
<p>
Tout le monde en parle : ceux qu'ils l'ont sont fiers, les autres
le veulent absolument, mais de quoi je parle ?<br>
De la version 2 de Linux bien sur :-)
</p>
<p>
Notre architecture n'est pas en reste, puisque cette version est
aussi disponible pour Atari/Amiga.</p>
<p>
Malgr&eacute; ce que l'on pourrait croire en regardant les sources de
ce noyau, l'int&eacute;gration de notre architecture n'est pas totale
dans le source, puisqu'un patch doit &ecirc;tre apliqu&eacute; au noyau d'origine
(Intel) pour pouvoir &ecirc;tre compil&eacute; sur Atari/Amiga.<br>
Ce patch diminuant de version en version, l'int&eacute;gration totale
devrait &ecirc;tre proche.</p>
Contrairement &agrave; la version Intel, cette version n'est pas consid&eacute;r&eacute;e
comme une version stable mais comme une version de d&eacute;veloppement, 
donc "use at your own risk" ;-)</p>
<p>
La version stable &agrave; ce jour est toujours la 1.2.13pl10</p>
<p>
Les possesseurs d'Atari/Amiga sans co-pro ne doivent plus &ecirc;tre
frustr&eacute;s, puisqu'un &eacute;mulateur de FPU a &eacute;t&eacute; int&eacute;gr&eacute; dans la 
version stable cit&eacute;e ci-dessus et dans le patch de la v2, donc
plus d'excuses : installez Linux :-)</p>
              
<p>
</p>
<p>
J'en vois deja qui disent : "Avoir un noyau c'est bien, mais avoir 
une distribution simple d'installation c'est mieux"</p>
<p>
Et bien, cette distribution tant attendu va arriver tr&egrave;s bient&ocirc;t :
il s'agit d'un portage de la <A HREF="http://www.debian.org">Debian</A>.<br>
Les packages sont presque tous compil&eacute;s, et sont op&eacute;rationnels. Le
seul gros manque pour le moment est l'absence du programme 
d'installation, c'est-&agrave;-dire, qu'il faut deja avoir un Linux qui
marche pour pouvoir installer les diff&eacute;rents packages de la Debian.
Mais c'est d&eacute;j&agrave; tr&egrave;s pratique pour mettre &agrave; jour son syst&egrave;me
simplement.<br>
Si vous souhaitez participer &agrave; ce portage, n'h&eacute;sitez pas &agrave; vous faire
connaitre.</p>

<p>
</p>
<hr>
&copy; <A HREF="mailto:cure@cnam.fr">David Cure</A> /
<i> 4 juillet 1996</i>

</BODY>

</HTML>
