<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Draft//EN">
<HTML>
<HEAD>
<TITLE>Linux Information Sheet: Introduzione a Linux</TITLE>
</HEAD>
<BODY>
Precedente
<A HREF="INFO-SHEET-2.html">Successivo</A>
<A HREF="INFO-SHEET.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introduzione a Linux</A></H2>

<P>
<P>Linux &egrave; una reimplementazione di POSIX liberamente distribuibile, con
estensioni SYSV e BSD (significa che sembra simile a Unix, ma non deriva
dallo stesso codice sorgente), disponibile sia in codice sorgente sia in
forma binaria. &Egrave; protetto dai diritti di autore da Linus B. Torvalds
(<CODE>Linus.Torvalds@Helsinki.FI</CODE>) e altri collaboratori ed &egrave;
liberamente distribuibile entro i termini della Licenza Pubblica GNU.
<P>Linux <B>non</B> &egrave; di pubblico dominio, non &egrave; nemmeno ``shareware''. &Egrave;
software ``libero'', comunemente chiamato ``<B>freeware</B>'': si pu&ograve;
copiare, ma si devono lasciare i sorgenti con esso o renderli disponibili
in qualche modo. Distribuendo qualsiasi modifica, devono essere allegati i
relativi sorgenti.  Vedere la Licenza Pubblica Generale GNU per i dettagli.
Una copia &egrave; inclusa con i sorgenti Linux, oppure la si pu&ograve; prelevare via
FTP da <CODE>prep.ai.mit.edu</CODE> in <CODE>/pub/gnu/COPYING</CODE>.
<P>Linux &egrave; ancora libero, come nella versione 2.0, e continuer&agrave; ad esserlo.
La natura del copyright GNU, a cui Linux &egrave; soggetto, rende illegale porre
restrizioni alla sua distribuzione.  Da notare che &egrave; perfettamente
legale far pagare denaro per la distribuzione di Linux, a patto che venga
distribuito anche il codice sorgente. Questa &egrave; una generalizzazione; per
aspetti pi&ugrave; accurati, leggere la GPL.
<P>Linux gira su macchine 386/486/Pentium con bus ISA, EISA, PCI e VLB.  MCA
(bus della IBM) non &egrave; attualmente ben supportato, sebbene nella nuova
versione in fase di sviluppo, 2.1.x, il supporto sia stato inserito.  Se
siete interessati, guardate 
<A HREF="http://glycerine.itsmm.uni.edu/mca">http://glycerine.itsmm.uni.edu/mca</A>.
<P>C'&egrave; un trasporto in corso per piattaforme Motorola 680x0 multiprocessore
(attualmente funzionanti in alcuni Amiga, Atari e macchine VME), che ora
funziona abbastanza bene. Richiede un 68020 con MMU, un 68030, un 68040 o
un 68060 e richiede anche l'FPU. Per ora funzionano il supporto di rete e
la piattaforma X.
<P>Linux funziona bene sulle CPU Alpha della DEC, supportando attualmente le
piattaforme ``Jensen'', ``NoName'', ``Cabriolet'', ``Universal Desktop
Box'' (meglio conosciuta come ``Multia''). Per altre informazioni,
guardate 
<A HREF="http://www.azstarnet.com/~axplinux/FAQ.html">http://www.azstarnet.com/~axplinux/FAQ.html</A>.
<P>Linux funziona bene su Sun SPARC e viene utilizzato gi&agrave; su molte macchine
sun4c e sun4m e il supporto per sun4u &egrave; in attivo sviluppo. Red Hat Linux
&egrave; (alla scrittura di questo testo) la sola distribuzione disponibile per
SPARC; guardate 
<A HREF="http://www.redhat.com/support/docs/rhl-sparc/">http://www.redhat.com/support/docs/rhl-sparc/</A>.
<P>Linux &egrave; in attiva fase di trasporto per architetture PowerPC, compresi
PowerMac (Nubus e PCI), Motorola, IBM e macchine Be.
<P>Trasporti su altre macchine, inclusi MIPS e ARM, sono in corso e stanno
mostrando dei progressi. Non trattenete il fiato, ma se siete interessati
e capaci di contribuire, potete trovare facilmente altri sviluppatori che
vorrebbero lavorare con voi.
<P>Linux non &egrave; pi&ugrave; considerato in test beta da quando &egrave; stata
rilasciata la versione 1.0 il 14 marzo 1994. C'erano ancora bug nel
sistema, e nuovi bug salteranno fuori e saranno risolti col passare del
tempo. Siccome Linux segue il ``modello a sviluppo aperto'', tutte le
nuove versioni sono rilasciate al pubblico anche se non sono considerate
``prodotti di qualit&agrave;''. Comunque, per aiutare la gente a capire se sta
prelevando una versione stabile o no, &egrave; stato adottato il seguente
schema: Versione 1.x.y, dove x &egrave; un numero pari, sono le versioni
stabili, e come vengono risolti bug viene incrementato y. Cos&igrave; dalla
versione 1.2.2 alla 1.2.3 ci fu solo un bug risolto e non nuove
caratteristiche. Versioni 1.x.y, dove x &egrave; un numero dispari, sono di
qualit&agrave; beta per soli sviluppatori, e possono quindi essere
instabili e cadere (crash), ma hanno nuove caratteristiche aggiunte.
<P>L'attuale versione stabile &egrave; 2.0.27 (questa continua a cambiare a mano a
mano che vengono aggiunti nuovi supporti hardware e corretti bug), ed &egrave;
partito lo sviluppo dei kernel sperimentali 2.1.x.  Se il 2.0.x &egrave; troppo
fresco per voi, potete continuare ad usare l'1.2.13. Comunque, l'ultimo
rilascio della 2.0 ha mostrato abbastanza stabilit&agrave;. Notate che per
passare dalla 1.2 alla 2.0 bisogna aggiornare parecchi pacchetti oltre al
kernel; &egrave; pi&ugrave; semplice aggiornare il sistema usando una distribuzione
Linux recente da cui prelevare i pacchetti da aggiornare. I sorgenti del
kernel contengono anche un file, Documentation/Changes, che spiega questi
cambiamenti e altro.
<P>Molte versioni di Linux, beta o no, sono abbastanza stabili e si possono
usare se fanno ci&ograve; che &egrave; necessario.  Un sito ha utilizzato la versione
0.99pl15 per pi&ugrave; di 600 giorni senza avere crash, dalle ultime notizie che
se ne hanno.  (Sarebbe durato pi&ugrave; a lungo se l'operatore
non avesse commesso un errore col trasformatore principale di
alimentazione...) Altri hanno riportato tempi superiori ad un anno. Un
sito ha avuto Linux 0.99pl15 funzionante per oltre 600 giorni, da quello
che ha detto ultimamente.
<P>Una cosa da considerare &egrave; che Linux &egrave; sviluppato usando un modello
aperto e distribuito, invece di un modello chiuso e centralizzato come
molto altro software. Questo significa che la versione correntemente
sviluppata &egrave; sempre pubblica (con un ritardo di una o due settimane) in
modo che tutti possano usarla. Il risultato &egrave; che ogni volta una
versione con nuove funzionalit&agrave; viene rilasciata, quasi sempre contiene
bug, ma con il rapido sviluppo esistente i bug sono trovati e corretti
velocemente, spesso in ore, in quanto molta gente lavora per risolverli.
<P>In contrasto, il modello chiuso e centralizzato significa che una sola
persona o un gruppo lavora al progetto, e solo loro rilasciano il software
quando ritengono che funzioni bene. Spesso trascorre un lungo intervallo
tra le release, una lunga attesa per risolvere i bug e uno sviluppo lento.
Certamente l'ultima release del software pubblico &egrave; spesso di alta
qualit&agrave;, ma la velocit&agrave; di sviluppo &egrave; generalmente molto bassa.
<P>Al 20 dicembre 1996, la versione stabile corrente di Linux &egrave; 2.0.27,
e quella in fase di sviluppo &egrave; 2.1.16.
<P>
<P>
<HR>
Precedente
<A HREF="INFO-SHEET-2.html">Successivo</A>
<A HREF="INFO-SHEET.html#toc1">Indice</A>
</BODY>
</HTML>
