<HEAD>
<TITLE>
Utilisation de LINUX chez Lectra-Syst&egrave;mes
</TITLE>
</HEAD>
<BODY>


<IMG SRC="images/logo-blur.gif" ALIGN=left HSPACE=10> 
<H1> 
<P>Utilisation de LINUX 
<BR> chez Lectra-Syst&egrave;mes
</H1>
<P>
Article pour l'Echo de Linux (<em><b>Juillet 1996</b></em>) 
<address><a href="mailto:pierre@rd.lectra.fr">Pierre Ficheux 
(pierre@rd.lectra.fr)</a></address> 

<BR CLEAR=left>
<HR>

<H1>R&eacute;sum&eacute;</H1>

Cet article raconte l'histoire de l'adoption et de l'utilisation par une
soci&eacute;t&eacute; industrielle de taille importante d'un fabuleux syst&egrave;me d'exploitation 
d&eacute;velopp&eacute; et maintenu par l'Internet: <EM>LINUX</EM>
<P>
Le propos contenus dans cette article n'engagent que l'auteur et non la soci&eacute;t&eacute;
<A HREF="http://www.lectra.fr">Lectra Syst&egrave;mes</A>.
<HR>
<H1>Sommaire</H1>
<UL>
<LI> 1 - <A HREF="#1">Lectra Syst&egrave;mes, qui sommes-nous ?</A>
<LI> 2 - <A HREF="#2">Pourquoi utiliser UNIX&reg; ?</A>
<LI> 3 - <A HREF="#3">1995, la r&eacute;volution culturelle de Lectra</A>
<LI> 4 - <A HREF="#5">Les d&eacute;veloppements sous LINUX</A>
	<UL>
	<LI> 4.1 - <A HREF="#41">La proc&eacute;dure d'installation</A>
	<LI> 4.2 - <A HREF="#42">Le desktop OpenPartner</A>
	<LI> 4.3 - <A HREF="#43">Les applicatifs Lectra</A>
		<UL>
		<LI> 4.3.1 - <A HREF="#431">Le stylisme</A>
		<LI> 4.3.2 - <A HREF="#432">Le mod&eacute;lisme</A>
		<LI> 4.3.3 - <A HREF="#433">Le placement</A>
		<LI> 4.3.4 - <A HREF="#434">La d&eacute;coupe et le trac&eacute;</A>
		<LI> 4.3.5 - <A HREF="#435">La gestion de production</A>
		</UL>
	</UL>
<LI> 5 - <A HREF="#5">Les probl&egrave;mes rencontr&eacute;s</A>
<LI> 6 - <A HREF="#6">Conclusion</A>

</UL>
<A NAME=1>
<H1>Lectra Syst&egrave;mes, qui sommes-nous ?</H1>
<A HREF="http://www.lectra.fr">Lectra Syst&egrave;mes</A>
est un des deux leaders mondiaux dans la conception et la
r&eacute;alisation de solution de CAO, CFAO et machines de coupes principalement pour 
l'industrie de la confection et de la chaussure. Le si&egrave;ge de la soci&eacute;t&eacute; 
est situ&eacute; &agrave; Cestas, dans la banlieue de 
<A HREF="http://web.cr-aquitaine.fr/region/francais/villes/bordeaux.html">
Bordeaux (France)</A>. 
Le site occupe 500 personnes dont 150 pour la recherche et d&eacute;veloppement. 
<P>
Je suis moi-m&ecirc;me responsable des d&eacute;veloppement <EM>syst&egrave;me</EM> au sein du 
d&eacute;partement R&D. Le groupe syst&egrave;me est charg&eacute; des d&eacute;veloppements touchant au 
syst&egrave;me de base (proc&eacute;dure d'installation, librairies graphiques, outils).
<P>
Depuis les ann&eacute;es 80, Lectra &agrave; toujours d&eacute;velopp&eacute; ses propres calculateurs 
bas&eacute;es
sur des processeurs Motorola 680x0. La majeure partie du parc install&eacute; (environ
3000 clients dont 80% hors de France) utilise un syst&egrave;me d'exploitation
propri&eacute;taire, mono-t&acirc;che, &eacute;crit en assembleur 680x0 appel&eacute; MILOS pour 
"Micro Lectra Operating System".

<A NAME=2>
<H1>Pourquoi utiliser UNIX&reg; ? </H1>
Il y a quelques ann&eacute;es, Lectra
commen&ccedil;a &agrave; s'int&eacute;resser &agrave; des syst&egrave;mes de bases de donn&eacute;es relationnelles 
n&eacute;cessitant l'utilisation d'un syst&egrave;me plus puissant et surtout multi-t&acirc;che, 
multi-utilisateur. Apr&egrave;s quelques balbutiements sur des <EM>UNIX&reg;-like</EM>, le
choix se porta sur l'impl&eacute;mentation de l'UNIX&reg; AT&T System V3.2 pour architecture
680x0. Une petite &eacute;quipe dont je fis partie r&eacute;alisa le portage des sources 
Unisoft 
ainsi que de l'environnement graphique <EM>X Window System</EM>. 
<P>
Lectra d&eacute;cida ensuite de d&eacute;velopper une nouvelle ligne de calculateurs bas&eacute;es sur
des processeurs 68040, beaucoup plus puissant que le 68030. Le syst&egrave;me d'exploitation
choisi fut la version UNIX&reg; USL SVR4.0 et de nouveau un portage fut r&eacute;alis&eacute;.
<P>
La t&acirc;che &eacute;tait passionnante mais au fond de nous m&ecirc;mes, nous &eacute;tions persuad&eacute;s que
ce calculateur (appel&eacute; <EM>OpenCad</EM>) serait le dernier enti&egrave;rement con&ccedil;u par
les &eacute;quipes de R&D. Quelques individus passionn&eacute;s mais travaillant pour de trop
petites s&eacute;ries ne pouvaient plus lutter dans un march&eacute; du hardware entrain&eacute; par
la course &agrave; la puissance toujours plus grande et aux prix toujours plus bas...
<A NAME=3>
<H1>1995, la r&eacute;volution culturelle de Lectra</H1>
Malgr&eacute; le succ&egrave;s commercial des <EM>OpenCad</EM> chez nos clients, le Direction
de Lectra d&eacute;cida fort justement
&agrave; la fin de l'ann&eacute;e 1994 de lancer le d&eacute;veloppement d'une gamme de produits
enti&egrave;rement renouvel&eacute;e et cibl&eacute;e principlement sur une architecture Intel 486 et 
Pentium toujours sur un environnement UNIX&reg; et X Window System. Les applications
de base de donn&eacute;es, tr&egrave;s consommatrices de ressources, seraient par contre 
cibl&eacute;e sur des architectures SUN SPARC. 
<P>
Après quelques tests comparatifs
sur différentes versions d'UNIX&reg; sur PC, il fut décidé d'utiliser LINUX qui se
révèla à la fois robuste, performant et bon marché. Le fait d'avoir les sources
du système disponible fut également un gros argument en faveur de LINUX car
nous utilisons de nombreux périphériques spéciaux dont l'adaptation serait
beaucoup plus difficile sur un UNIX&reg; propriétaire.

<A NAME=4>
<H1>Les d&eacute;veloppements sous LINUX</H1>

Le syst&egrave;me &eacute;tant choisi, il s'agissait maintenant d'adapter LINUX &agrave; une 
solution industrielle. Il est clair en effet qu'UNIX&reg; (et donc LINUX) est 
relativement plus difficile &agrave;  utiliser pour un op&eacute;rateur final. Cette 
adaptation devait se faire &agrave; deux niveaux :
<UL>
<LI> au niveau de la proc&eacute;dure d'installation du produit final (on ne peut pas 
demander &agrave; un technicien (voire un client) de savoir installer une
<EM>Slackware</EM>. 
<LI> au niveau de l'interface utilisateur, de mani&egrave;re &agrave; ce que l'administration
de base de la station (r&eacute;seau, utilisateurs, droits d'acc&egrave;s) et les 
fonctionnalit&eacute;s sp&eacute;cifiques <EM>Lectra</EM> soient accessibles tr&egrave;s simplement
&agrave; un op&eacute;rateur non informaticien
</UL>

<A NAME=41>
<H2>La proc&eacute;dure d'installation</H2>

La distribution <EM>Lectra</EM> utilise cependant les m&ecirc;mes 
principes que les distributions pour d&eacute;veloppeur (2 diskettes de boot et un 
CD-ROM). Les &eacute;crans d'installation utilisent <EM>dialog-0.3</EM>, qui se 
r&eacute;v&egrave;le extr&egrave;mement simple et puissant pour cr&eacute;er des enchainements d'&eacute;crans
d'installation. Voici le menu principal de l'installation LINUX Lectra :
<P>
<IMG SRC="images/resized/menu.gif">
<P>
Le principal avantage du choix de LINUX
sur ce sujet est la possibilit&eacute; de r&eacute;aliser une proc&eacute;dure d'installation
extr&egrave;mement cibl&eacute;e (on n'installe que ce dont on a besoin) et donc tr&egrave;s rapide
(la version courante du Desktop Lectra s'installe en moins de 10 mn sur un 
Pentium 120).
<BR>
Comparativement, la m&ecirc;me version de desktop sur cible Solaris&reg; dure pratiquement
<EM>une heure</EM> car on doit tout d'abord installer le CD Solaris&reg;, puis les 
patches &eacute;ventuels puis en dernier le Desktop Lectra...
<P>

Les diff&eacute;rents packages sont g&eacute;n&eacute;r&eacute;s en 
tant que fichiers <EM>ISO-9660</EM> (avec extension Rock-Ridge) &agrave; partir d'une 
arborescence LINUX &agrave; l'aide du programme <EM>mkisofs</EM> puis les images ISO 
sont grav&eacute;es sur le CD master &agrave; l'aide d'un PC sous...<EM>Windows&reg;</EM>

<A NAME=42>
<H2>Le desktop OpenPartner</H2>

Les premi&egrave;res applications graphiques sous <EM>MILOS</EM> avaient un look tr&egrave;s
<EM>spartiate</EM> et ce &agrave; cause des faibles performances de controleurs graphiques
de l'&eacute;poque (le d&eacute;but des ann&eacute;es 1980). Les &eacute;crans, bien que graphiques, ne g&eacute;raient
alors que 16 couleurs et surtout n'utilisaient pas de <EM>multi-fen&egrave;trage</EM>.
<BR>
Press&eacute; par la concurrence, Lectra d&eacute;cida vers 1990 de faire &eacute;voluer les interfaces
graphiques vers un syst&egrave;me &agrave; multi-fen&egrave;trage permettant en plus de faciliter le 
tavail de l'op&eacute;rateur pour les manipulations de base comme le lancement des 
applicatifs ou la manipulation de fichier. <BR>
Cet outils appel&eacute; 
<EM>OpenPartner&reg;</EM> fut donc initialement d&eacute;velopp&eacute; pour la cible MILOS en 
utilisant une librairie propri&eacute;taire et de bas niveau (ressemblant aux appels de
la <EM>Xlib</EM>). La structure de l'interface ressemblait cependant beaucoup a celle
de la hierarchie des <EM>Widgets Xt</EM>, ce en vue d'un portage prochain et certain
vers l'environnement UNIX&reg;/X11. 
<P>
La portage d'OpenParner&reg; vers l'environnement UNIX&reg; s'accompagna de l'ajout de
fonctionnalit&eacute;s administration de la station par un utilisateur privil&egrave;gi&eacute;, en 
particulier :
<UL>
<LI> L'ajout et la suppression de packages Lectra
<LI> La gestion du r&eacute;seau (ajout/suppression de stations, gestion des montages
 NFS)
<LI> La gestion des lignes s&eacute;ries et des modems
<LI> La gestion des imprimantes
<LI> La gestion des licences des applicatifs Lectra
<LI> La gestion des utilisateurs et particuli&egrave;rement les applicatifs autoris&eacute;s
&agrave; chacun d'eux
</UL>
<P>
Voici un aper&ccedil;u de la fen&ecirc;tre principale de l'environnement 
<EM>OpenPartner</EM> avec l'utilitaire de gestion des packages (P-manager)
<P>
<IMG SRC="images/resized/pmanager.gif">
<P>
Une des t&acirc;ches importante fut de d&eacute;velopper un syst&egrave;me de gestion d'imprimante
extensible et simple d'utilisation. M&ecirc;me en tant que supporter d'UNIX&reg;, nous 
sommes forc&eacute;s d'admettre que le syst&egrave;me d'impression sur <EM>Windows&reg;</EM> ou
bien <EM>MacOS</EM> est nettement plus simple &agrave; utiliser que sur notre OS
favori. D'autant que toute imprimante commercialis&eacute;e l'est aujourd'hui avec son
driver <EM>Windows&reg;</EM> ou <EM>MacOS&reg;</EM>.
<BR>
Notre syst&egrave;me d'impression (fonctionnant en client/serveur) utilise le 
programme
<EM>ghostscript</EM> et permet de g&egrave;rer divers types d'imprimantes (PCL, 
PostScript, raster) sur des connexion vari&eacute;es (ligne s&eacute;rie, Centronics, 
r&eacute;seau, SCSI).
Un outil graphique int&egrave;gr&eacute;e &agrave; <EM>OpenPartner</EM> (I-manager) permet de 
s&eacute;lectionner
simplement les caract&eacute;ristiques des imprimantes utilis&eacute;es (la liste 
apparaissant ensuite dans le selecteur d'impression des applicatifs Lectra)
<P>
<IMG SRC="images/resized/imanager.gif">
<P>

<A NAME=43>
<H2>Les applicatifs Lectra</H2>
Les applicatifs sont destin&eacute;s aux professionnels de l'industrie de la 
confection. La conception d'un v&ecirc;tement passe par diverses phases, correspondant
&agrave; diff&eacute;rents m&eacute;tiers. Une des caract&eacute;ristiques de l'industrie de la confection
est le recours &agrave; la sous-traitance et &agrave; la d&eacute;localisation. Certaines phases de la
conception pourront &ecirc;tre r&eacute;alis&eacute;e par le confectionneur et la fabrication elle m&ecirc;me
sous-trait&eacute;e dans un autre pays. 
<P>
Certaines entreprises ne font que de la conception ou seulement de la fabrication et 
fournissent plusieurs grandes marques...
<P>
Le r&eacute;sultat de cette situation pour une soci&eacute;t&eacute; comme Lectra est la n&eacute;cessit&eacute; absolue
de concevoir des logiciels ouverts car peu de clients ach&egrave;teront une chaine compl&egrave;te
et il est donc n&eacute;cessaire de savoir dialoguer avec les logiciels concurrents !
<P>
En premi&egrave;re approche, nous pouvons d&eacute;gager les phases suivantes lors de la conception
du v&ecirc;tement :

<A NAME=431>
<H3>Le stylisme</H3>

Le styliste est charg&eacute; de r&eacute;aliser une maquette du v&ecirc;tement sous forme de dessin 
d'artiste. Son travail sera principalement ax&eacute; sur le choix des formes, des 
couleurs, des types de tissus utilisables. <BR>
Les avantages d'une outils informatique sont &eacute;vidents. Outre la possibilit&eacute; de
travailler sur une "feuille &eacute;lectronique", le logiciel permettra au styliste
d'importer des motifs de tissus (directement sous forme &eacute;lectornique ou bien
en utilisant un <EM>scanner</EM>), d'archiver les esquisses de diff&eacute;rentes
collections, de faire une simulation de tissus sur une forme 2D ou 3D.
<P>
Le logiciel <EM>ProStyle&reg;</EM> propose entre-autres les fonctionnalit&eacute;s 
pr&eacute;cedentes sur PC Linux <EM>haut de gamme</EM> (Pentium 120 avec carte graphique
Diamond Stealth S3-968, 16 Millions de couleurs). Des sorties sur imprimante &agrave; 
sublimation (le plus souvent SCSI) sont &eacute;galement disponibles. Le logiciel est 
&eacute;galement port&eacute; sur architecture Silicon Graphics.

<P>
<IMG SRC="images/resized/prostyle.gif">
<P>

<A NAME=432>
<H3>Le mod&eacute;lisme</H3>

Le mod&eacute;liste doit r&eacute;aliser le <EM>patron</EM> du v&ecirc;tement (en fait le plan avec
cotation) &agrave; partir de l'information de stylisme. Il doit &eacute;galement g&egrave;rer les 
diff&eacute;rentes tailles disponibles (la gradation). <BR>
L'informatisation de cette phase est une des plus int&eacute;ressantes (avec le placement)
car elle contient une forte composante de rentabilit&eacute; (le nombre de patrons produits)
<P>
Voici une vue de l'&eacute;cran initial de l'applicatif <EM>Modaris&reg;</EM>, applicatif
Lectra destin&eacute; au mod&egrave;liste :
<P>
<IMG SRC="images/resized/modaris.gif">
<P>

<A NAME=433>
<H3>Le placement</H3>

Le placeur doit optimiser l'utilisation de la mati&egrave;re (la pi&egrave;ce de tissus appel&eacute;e 
<EM>laize</EM>) en fonction de la liste de pi&egrave;ces donn&eacute;e par le mod&eacute;liste. La qualit&eacute;
du travail d'une placeur s'exprime par l'<EM>efficience</EM> d'un placement (ce qui
correspond &agrave; la quantit&eacute; de mati&egrave;re utilis&eacute;e par rappoart &agrave; la mati&egrave;re perdue). Un 
bon placeur arrive en moyenne &agrave; une efficience de 85%, soit 15% de la mati&egrave;re perdue.
Un gain de quelques dixi&egrave;mes de % sur un production peut avoir de fortes cons&eacute;quences
&eacute;conomiques dans le cas de mati&egrave;res couteuses comme le cuir ou des tissus haut de 
gamme.
<P>
Le logiciel <EM>Diamino&reg;</EM> tournant sur PC LINUX propose un placement 
semi-automatique qui facilitera le travail du placeur en facilitant le 
positionnement de la pi&egrave;ce. Il propose &eacute;galement un nouveau module de placement 
<EM>automatique</EM> (qui place toutes les pi&egrave;ces sur la laize sans intervention 
humaine) dont les performances s'approche aujourd'hui &agrave; 2% de celle d'un placeur 
professionnel. 
<P>
Les architectures PC d'aujourd'hui permettent d'obtenir un tel r&eacute;sultat pour un 
prix tr&egrave;s attractif et l'existence <EM>&eacute;conomique</EM> d'un module efficace de 
placement automatique &eacute;tait impossible il y seulement quelques ann&eacute;es pour des 
raisons de co&ucirc;t du mat&eacute;riel.
<P>
Nous pouvons voir ci-dessous l'&eacute;volution des performances du module de placement 
automatique en fonction de l'architecture utilis&eacute;e (temps en secondes) :
<P>
<IMG SRC="images/resized/plc.gif">
<P>
Les 2 premi&egrave;res colonnes concernent les anciens calculateurs Lectra X400 et X410 
respectivement bas&eacute;s sur des processeurs 68030 et 68040 et tournant sous 
System V R4.
<P>
Les 3 PC (DX2/66, Pentium75, Pentium120) tournent sous Linux-1.2.13.

<A NAME=434>
<H3>La d&eacute;coupe et le trac&eacute;</H3>

La d&eacute;coupe des pi&egrave;ces peut se faire &agrave; la main ou bien avec une 
<A HREF="http://www.lectra.com/images/ImgProd/vector2500.jpg">machine de coupe</A> qui
aura bien entendu l'avantage d'avoir un bien meilleur rendement. Dans certains 
cas, on ne d&eacute;coupera pas les pi&egrave;ces mais on se contentera de 
<A HREF="http://www.lectra.fr/images/ImgProd/flypen.jpg">tracer</A> les formes 
sur un
support papier afin de le fournir au sous-traitant.
<BR>
L'ancienne gamme de produit Lectra n&eacute;cessitait l'achat d'un calculateur par traceur
ou d&eacute;coupeur car le syst&egrave;me d'exploitation MILOS des calculateurs &eacute;tait mono-t&acirc;che
(les traceur et d&eacute;coupeurs sont command&eacute;s par voies s&eacute;ries)
<P>
Le nouveau logiciel <EM>VigiPrint&reg;</EM> d&eacute;velopp&eacute; sous LINUX permet de 
controler une dizaine de traceurs simultan&eacute;ment d'ou un gain de co&ucirc;t 
non-n&eacute;gligeable &agrave; l'achat
de la configuration et une facilit&eacute; beaucoup plus grande pour controler le 
trac&eacute; (on g&egrave;re les traceurs sur le m&ecirc;me &eacute;cran). 
<BR>
Le nombre de d&eacute;coupeurs g&egrave;r&eacute;s par le logiciel est
limit&eacute; &agrave; un seul pour des raisons de s&eacute;curit&eacute; (l'op&eacute;rateur doit &ecirc;tre attentif &agrave; une
&eacute;ventuelle rupture de lame ou tout autre anomalie). La d&eacute;coupe se fait soit avec 
une lame (cas le plus fr&eacute;quent), un jet d'eau haute pression (2000 bars) ou un 
faisceau laser.

<A NAME=435>
<H3>La gestion de production</H3>

Elle permet de g&egrave;rer toutes les donn&eacute;es manipul&eacute;es par les m&eacute;tiers pr&eacute;c&eacute;dents. On
peut ainsi d&eacute;finir pour un produit donn&eacute; des dossiers de suivi de production
qui seront archiv&eacute;es dans des bases de donn&eacute;es relationnelles. Ces bases permettent
d'archiver et de r&eacute;-utiliser pour la collection en cours  certains &eacute;lements d'une 
collection pr&eacute;c&eacute;dente (logiciels <EM>MasterLink &reg</EM>; et <EM>StyleBinder&reg;</EM>)
<P>
Ci-dessous un &eacute;cran du logiciel <EM>StyleBinder&reg;</EM> sous LINUX :
<P>
<IMG SRC="images/resized/styleb.gif">

<A NAME=5>
<H1>Les probl&egrave;mes rencontr&eacute;s</H1>

Le principal probl&egrave;me est l'int&eacute;gration de nouveau p&eacute;riph&eacute;riques, le monde du
PC &eacute;tant litt&eacute;ralement sous la coupe de Microsoft. Certains constructeurs 
de p&eacute;riph&eacute;riques (principalement les petits constructeurs) sont attentifs &agrave;
l'&eacute;volution de LINUX et collaborent facilement &agrave; l'&eacute;laboration des drivers. Les
grosses structure sont beaucoup plus difficiles &agrave; convaincre et se r&eacute;fugient
souvent derri&egrave;re des imp&eacute;ratifs de "strat&eacute;gie marketing" pour refuser de
fournir les informations n&eacute;cessaires. Ce refus masque souvent une totale
m&eacute;connaissance des solutions autres que Microsoft principalement au niveau des
supports techniques, les &eacute;quipes de d&eacute;veloppement &eacute;tant rarement directement 
accessibles dans de telles structures.
<P>
Cependant, les probl&egrave;mes rencontr&eacute;s sont relativement limit&eacute;s en nombre :
<UL>
<LI> La carte <EM>MATROX Millenium</EM> qui n'est pas support&eacute;e par 
<EM>XFree86</EM> (pour cause de non-fourniture par MATROX au consortium
XFree86 des informations techniques n&eacute;cessaires). Cette situation est bloquante
pour nous car les applicatifs Lectra utilisent des p&eacute;riph&eacute;riques sp&eacute;ciaux
(tablettes graphiques, mini-clavier, crayon &agrave; ultra-sons) qui n&eacute;cessitent une 
modification
du serveur X pour les g&egrave;rer en tant qu'"input extensions". Notre choix s'est
donc rabattu sur des cartes bas&eacute;es sur des circuits S3 (Diamond et #9)

<LI> Les p&eacute;riph&eacute;riques de sauvegardes sur port parall&egrave;le ne sont pas 
utilisables avec LINUX car l'utilisation du port est propre &agrave; chaque fabricant
et les informations sur les protocoles utilis&eacute;es sont extr&egrave;ment difficile &agrave;
obtenir. Nous n'utilisons donc que des p&eacute;riph&eacute;riques SCSI et des drives
internes sur port floppy (F-Tape)

<LI> L'installation de LINUX sur les PC Notebook est parfois difficile pour 
cause de circuits graphiques sp&eacute;ciaux non support&eacute;s par XFree86

</UL>
<P>
D'autres sujets nous ont caus&eacute; (et nous causent encore parfois) 
quelques soucis :

<UL>

<LI> L'absence (pour l'instant) d'un &eacute;mulateur <EM>Windows&reg;</EM> de niveau 
"professionnel" est un gros manque pour nous car nos clients ont parfois besoin
de r&eacute;cup&egrave;rer des documents provenant de <EM>Windows&reg;</EM> pour les int&eacute;grer
dans nos applicatifs. La disponibilit&eacute; prochaine d'un logiciel de ce type
serait un plus non n&eacute;gligeable pour la g&eacute;n&eacute;ralisation de LINUX dans les
solutions desktop.  

<LI> La gestion du swap sur Linux-1.2.13 semble moins bonne que sur certains 
autres versions d'UNIX&reg; (comme SunOS&reg;-4.1 par exemple). Il semble, d'apr&egrave;s nos
premiers tests que le fonctionnement du swap sur Linux-2.0  soit grandement 
am&eacute;lior&eacute;.

<LI> L'environnement Lectra utilise de mani&egrave;re intensive l'interface SCSI (pour
certaines imprimantes haut de gamme et &eacute;galement pour des scanners) et nous 
avons corrig&eacute;s quelques bugs sur le driver SCSI Linux. Les corrections 
rapport&eacute;es aux d&eacute;veloppeurs LINUX, semblent avoir &eacute;t&eacute; int&egrave;gr&eacute;es dans le noyau 
2.0.

</UL>

<A NAME=6>
<H1>Conclusion</H1>

L'exp&eacute;rience de la nouvelle gamme Lectra montre que l'on peut construire une
solution industrielle sur LINUX. Le syst&egrave;me est stable, puissant, robuste et 
l'on peut r&eacute;cup&eacute;rer un grand nombre d'informations gr&acirc;ce &agrave; Internet, qui se 
r&eacute;v&egrave;le &ecirc;tre le plus performant des supports techniques. Le fait de disposer des
sources de syst&egrave;me permet de d&eacute;velopper plus facilement certaines fonctionnalit&eacute;s 
(drivers de mat&eacute;riel ou protocoles propir&eacute;taires, file-system particuliers).
<P>
Les nouvelles orientations
annonc&eacute;es lors du dernier congr&egrave;s LINUX de Berlin pour (am&eacute;lioration des Virtual
File System, optimisation du file system EXT2, sortie de WABI, multi-processeur,
adoption de LINUX par Digital) nous conforte dans l'id&eacute;e que LINUX acquiert 
une forte maturit&eacute; industrielle.
<P>
En plus de cela, le choix d'une plate-forme PC permet d'offrir au client 
la possibilit&eacute; d'avoir des applicatifs industriels et bureautiques sur la m&ecirc;me m
achine (avec double boot LINUX/Windows&reg;). L'&eacute;mulation performante de Windows&reg; sera
certainement un atout majeur pour la g&eacute;n&eacute;ralisation de LINUX dans les solutions
desktop industrielles.

